NKQC/maimai-input-control-firmware/psoc_firmware/CY8C4147AZI-SensorCore/main.c
/******************************************************************************
 * File Name:   main.c
 *
 * Description: PSoC 4 SPI Slave with CAPSENSE and Status LED
 * - SPI Slave: SCB0 (SLAVE, MODE0, 8-bit, MSB-first, CS ActiveLow)
 * - CAPSENSE: 36 buttons, immutable double-buffered snapshots
 * - Status LED: P1.6 (CYBSP_LED_SLD3)
 * - FW_VERSION: 编译时间戳 YYMMDDHHMM(十进制, 本地时间), 由 Makefile PREBUILD 生成
 *   fw_build_stamp.h 提供; 上位机补 "20" 前缀还原 YYYYMMDDHHMM
 * - JIT algo engine: 1KB executable RAM slot (ABI v1, psoc_algo_abi.h),
 *   uploaded via ALGO_BEGIN/PAGE/END/INFO SPI commands, CRC16-CCITT-FALSE
 *   verified commit in main loop, falls back to Cy_CapSense_IsWidgetActive
 *   when no valid algo is loaded.
 ******************************************************************************/

#include "cy_pdl.h"
#include "cybsp.h"
#include "cycfg.h"
#include "cycfg_capsense.h"
#include "psoc_algo_abi.h"
#include "fw_build_stamp.h"
#include <stdint.h>
#include <string.h>

/* 版本号 = 编译时间戳(十进制 YYMMDDHHMM, 本地时间), 每次 make build 由 PREBUILD 重新生成。
 * 线上格式不变: 仍是 u32, PING 响应照旧拆 4 字节上报。
 * 已知上限: YY <= 42 才放得进 u32, 2043 年起下面的断言会让构建直接失败。 */
#define FW_VERSION                       (FW_BUILD_STAMP)
_Static_assert(FW_VERSION <= 0xFFFFFFFFu, "FW_BUILD_STAMP overflows uint32 (YY > 42?)");

#define SENSOR_FRAME_MAGIC               (0xA5u)
#define SENSOR_CMD_PING                  (0x01u)
#define SENSOR_CMD_PONG                  (0x02u)
#define SENSOR_CMD_TOUCH                 (0x03u)  /* 实时触控态：7字节帧 [magic,TOUCH,mask0..mask4] */
#define SENSOR_CMD_SNAPSHOT_BEGIN        (0x10u)
#define SENSOR_CMD_SNAPSHOT_INFO         (0x11u)
#define SENSOR_CMD_SNAPSHOT_PAGE         (0x12u)
#define SENSOR_CMD_SNAPSHOT_DATA         (0x13u)
#define SENSOR_CMD_INDICATOR_ON          (0x20u)
// ---- Phase A：CSD 运行时指令通道（7字节帧 [magic,cmd,ch,param_id,val_lo,val_mid,val_hi]，value 24位）----
#define SENSOR_CMD_SET_PARAM             (0x30u)  // 写 widgetContext[ch].<param_id> = value
#define SENSOR_CMD_GET_PARAM             (0x31u)  // 读回；响应 [magic,GET_PARAM,ch,param_id,val24]
#define SENSOR_CMD_SET_MODE              (0x32u)  // ch 位置=mode(0=自动校准/标准完整处理, 1=半自动手动)
#define SENSOR_CMD_APPLY                 (0x33u)  // 应用参数：重扫/重校准使硬件参数生效
#define SENSOR_CMD_GET_RAW               (0x34u)  // 读指定通道实时 raw 计数；响应 [magic,GET_RAW,ch,raw_lo,raw_hi]
#define SENSOR_CMD_GET_STATS              (0x35u)  // 读全局扫描计数(每秒采样率由 RP2040 用其时钟算)
#define SENSOR_CMD_MEASURE_CP            (0x36u)  // 触发逐电极 Cp 测量；SPI ACK 后由主循环异步执行
#define SENSOR_CMD_GET_CP                (0x37u)  // pending/active=0，成功=fF，失败/未测量=0xFFFFFF
// ---- 全局 CSD 配置(RAM 影子 common config，改后需 APPLY 重初始化生效)----
// 帧 [magic,cmd,gparam_id,0,val_lo,val_mid,val_hi]，值 24 位。
#define SENSOR_CMD_SET_GLOBAL            (0x38u)  // 写 g_common_cfg_ram.<gparam>(仅改影子,不重初始化)
#define SENSOR_CMD_GET_GLOBAL            (0x39u)  // 读回；响应 [magic,GET_GLOBAL,gparam_id,0,val24]
#define SENSOR_CMD_GLOBAL_COMMIT         (0x3Au)  // 全部全局项设完后触发【一次】完整重初始化(合并,防反复重校准漂移)
#define SENSOR_CMD_CALIBRATE             (0x3Bu)  // 真正的 IDAC 重校准(CalibrateAllWidgets)+基线复位, 主循环执行
#define SENSOR_CMD_BASELINE_RESET        (0x3Cu)  // 仅重置全部通道基线(InitializeAllBaselines), 主循环执行
// 频率自适应(三步): ①粗表升分频定位首个可校准档 ②从该档 -1 起逐 1 升频重校准找"临界分频"
// (最后一个仍能校准成功的最小分频=最高频率=最不灵敏) ③按偏好档位往低频让 2*(pref-1) 个分频落档
// (分频越大=频率越低=充电越充分→过充产生近场探测效应→越灵敏), 失败则朝临界方向逐 1 回退。
// 帧字节2=通道号: 0..35=仅该通道自适应(只改该 widget 的 snsClk), 0xFF=全 36 通道【逐通道各自校准】
// (外层遍历 36 个通道, 每通道独立跑完整三步算法得到各自的分频; 面板 Cp 22~138pF 无法共用统一分频)。
// 帧字节3=偏好档位 pref(1..7, 非法值退化为 4): 1=临界最高频(最不灵敏), 7=最低频(最灵敏)。
#define SENSOR_CMD_AUTO_TUNE             (0x3Du)
// 读自适应结果/进度; 响应 [magic,GET_AUTO_TUNE,result(0进行中/1成功/2失败),ch,div_lo,div_hi,progress]。
// ★resp[6]=progress 字节(原 val24 最高字节恒 0, 现复用为阶段进度, 旧 RP2040 只读 resp[4..5] 故向后兼容)★:
//   bit0-2 = phase: 0=空闲/已受理 1=粗定位 2=细搜临界 3=落档/回退 4=完成
//   bit3-7 = step : 当前阶段内步序(从 1 起递增, 上限饱和 31)
// ★resp[4..5]=div 的语义随 result 变化★:
//   result==0(进行中) → 当前正在试探的 snsClk 分频(供上位机显示"正在试 ÷N");
//   result!=0(已完成) → 最终写入 widgetContext 的分频(成功)或 0(失败)。
#define SENSOR_CMD_GET_AUTO_TUNE         (0x3Eu)
/* ★通道号哨兵(全通道)★ 单一取值, 供 CALIBRATE / BASELINE_RESET / AUTO_TUNE 共用 ——
 * 不为每条命令另造一个"全通道"常量, 免得三处各写一份必然漂移。 */
#define SENSOR_CH_ALL                    (0xFFu)
#define AUTO_TUNE_CH_ALL                 SENSOR_CH_ALL  // AUTO_TUNE 通道号哨兵: 全通道(同 SENSOR_CH_ALL)
// 全局参数 id
#define GPARAM_INACTIVE_SNS              (0x01u)  // 未激活传感器连接: 1=GND 2=High-Z 4=Shield
#define GPARAM_IDAC_GAIN_INIT            (0x02u)  // csdIdacGainInitIndex(IDAC 增益档索引)
#define GPARAM_IDAC_MIN                  (0x03u)  // csdIdacMin(CSD 校准最小 IDAC)
#define GPARAM_RAW_TARGET                (0x04u)  // csdRawTarget(校准目标 raw 百分比)
#define GPARAM_MFS_DIV_F1                (0x05u)  // csdMfsDividerOffsetF1(多频通道1分频偏移)
#define GPARAM_MFS_DIV_F2                (0x06u)  // csdMfsDividerOffsetF2(多频通道2分频偏移)
#define GPARAM_IDAC_SENSE_CONFIG         (0x07u)  // csdChargeTransfer: 0=IDAC sourcing, 1=IDAC sinking (运行时可设)
#define GPARAM_AUTO_CALIBRATE_EN         (0x08u)  // 运行时是否自动校准: 0=固定IDAC(不自动校准), 1=Init/Apply 自动校准
// ---- SPI DMA 链路只读诊断计数(复用 GET_GLOBAL 通道, 不新增命令码) ----
// 用于在"RP2040 读回全 0"时区分故障域: 帧到底有没有进来、magic 对不对、CS 重同步有没有在发生。
#define GPARAM_DBG_RX_FRAMES             (0x80u)  // RX DMA 完成中断次数(收到的完整 7 字节帧数)
#define GPARAM_DBG_RX_BAD_MAGIC          (0x81u)  // 收到但 magic != 0xA5 的帧数(=帧错位的直接证据)
#define GPARAM_DBG_CS_RESYNC             (0x82u)  // CS 抬起时发现半帧而做重同步的次数
#define GPARAM_DBG_TX_ARM                (0x83u)  // TX 描述符重挂次数
#define GPARAM_DBG_RX_LEFTOVER           (0x84u)  // CS 抬起时 RX FIFO 仍有残字节的次数
// 只读: 启动时固件对生成配置做过哪些强制改写(位掩码)。上位机据此把"设备被固件改过"如实告知用户,
// 杜绝"UI 显示用户设定值、设备实际另一个值"的静默不同步。
//   bit0 = IDAC 增益档被抬到下限(生成配置默认 0 会全片 railed, 必须抬)
//   bit1 = 校准目标% 非法(0 或 >=100)被改成 85
#define GPARAM_BOOT_OVERRIDE             (0x09u)
// 注: IDAC 自动校准/补偿IDAC/自动增益 在 CapSense v5 是编译期宏(非 common_config 运行时字段),
//     无法运行时切换; 若需固定IDAC(不自动校准)换稳定灵敏度, 运行时路径=手动设 IDAC_MOD 且不触发校准。
// CapSense 参数 id（与上位机 proto PARAM_* 对齐）
#define PARAM_FINGER_TH                  (0x01u)
#define PARAM_NOISE_TH                   (0x02u)
#define PARAM_NEG_NOISE_TH               (0x03u)
#define PARAM_HYSTERESIS                 (0x04u)
#define PARAM_ON_DEBOUNCE                (0x05u)
#define PARAM_LOW_BSLN_RST               (0x06u)
#define PARAM_RESOLUTION                 (0x07u)
#define PARAM_SNS_CLK_DIV                (0x08u)
#define PARAM_IDAC_MOD                   (0x09u)
#define PARAM_SNS_CLK_SOURCE             (0x0Au)  // 时钟源(bit7=auto, 低位=PRS/direct 选择)
#define PARAM_IDAC_GAIN                  (0x0Bu)  // IDAC 增益档索引(增幅), 半自动手动调优用
/* ★通道启用开关(0=禁用/电极高阻, 1=启用)★
 * 这是硬件开关而非调参项: 禁用 = 该 widget 永久不参与扫描, 其电极保持模拟高阻(见 g_ch_enabled)。
 * 复用 SET_PARAM/GET_PARAM 通道, 不新增命令码。 */
#define PARAM_ENABLED                    (0x0Cu)
// CSD 处理模式
#define SCAN_MODE_AUTO                   (0u)  // 自动校准：运行中间件标准完整处理链
#define SCAN_MODE_SEMI                   (1u)  // 半自动手动：跳过噪声/阈值处理，保留 SET_PARAM 手动值
#define SENSOR_FRAME_SIZE                (7u)
#define SENSOR_FRAME_PAYLOAD_SIZE        (4u)
#define SENSOR_CHANNEL_COUNT             (36u)
#define SENSOR_BYTES_PER_CHANNEL         (7u)
#define SENSOR_SNAPSHOT_SIZE             (SENSOR_CHANNEL_COUNT * SENSOR_BYTES_PER_CHANNEL)
#define SENSOR_SNAPSHOT_PAGE_SIZE        (SENSOR_FRAME_PAYLOAD_SIZE)
#define SENSOR_SNAPSHOT_PAGE_COUNT       (SENSOR_SNAPSHOT_SIZE / SENSOR_SNAPSHOT_PAGE_SIZE)

/* SPI CS = P1.3 (SCB0 SPI SELECT0, 见 cycfg_routing.h)。HSIOM 交给 SCB 后端口输入仍可产生
 * GPIO 中断, 故可用它的上升沿(取消选择)作帧边界做 RX 重同步。 */
#define SPI_CS_PORT                      (GPIO_PRT1)
#define SPI_CS_NUM                       (3u)
#define SPI_CS_IRQ                       (ioss_interrupts_gpio_1_IRQn)

#define CAPSENSE_INTR_PRIORITY           (3u)
#define CY_ASSERT_FAILED                 (0u)
#define STATUS_LED_PORT                  (CYBSP_LED_SLD3_PORT)
#define STATUS_LED_NUM                   (CYBSP_LED_SLD3_NUM)
#define STATUS_LED_ON_STATE              (1u)
#define STATUS_LED_OFF_STATE             (0u)

#if ((SENSOR_SNAPSHOT_SIZE % SENSOR_SNAPSHOT_PAGE_SIZE) != 0u)
#error "Snapshot size must be an exact number of SPI pages"
#endif

static cy_stc_scb_spi_context_t spi_context;

typedef struct
{
    /* ★PING/PONG 双落帧缓冲(照搬官方 CE 的 SCB+DMAC 范式)★: 两个 RX 描述符【始终有效】、
     * flipping 交替, 故 SCB 的电平请求永远落在一个有效描述符上, 不存在"描述符刚完成/被软件
     * 重置时正好来触发"的窗口。此前单描述符 + ISR 内 SetState(true) 正是踩了这个窗口:
     * SetState 会清 CURR_DATA_NR, 与仍在推进的字节流相撞 → RX 通道搬完一帧后即失效,
     * 之后再不产生完成中断 ⇒ TX 永不重挂 ⇒ RP2040 恒读回全 0(与 TX 填充方式无关)。 */
    volatile uint8_t rx_frame[2u][SENSOR_FRAME_SIZE];
    uint8_t tx_frame[SENSOR_FRAME_SIZE];
    volatile bool frame_received;
    volatile bool snapshot_copy_pending;
    volatile uint8_t snapshot_source_index;
    volatile uint8_t snapshot_sequence;
} spi_dma_state_t;

static spi_dma_state_t spi_dma;

/* SPI 链路诊断计数(只读, 经 GET_GLOBAL 的 GPARAM_DBG_* 上报)。同一功能组归拢成 struct,
 * 避免散装全局量; 需要整体归零时用 _spi_dbg_clear()。 */
/* ★带外 SWD 取数用的定位 magic★: 带内 GET_GLOBAL 在链路故障态读不出来(实测全 None), 故本块必须
 * 能被 RP2040 经 SWD 直接读。为免改 BSP 链接脚本(生成文件, 改了脆), 不固定地址, 而是在块首放一对
 * magic 字, 由 RP2040 扫描 SRAM(0x20000000..0x20004000, 16KB) 一次定位后缓存地址。 */
#define SPI_DBG_MAGIC0                   (0x53504442u)   /* "SPDB" */
#define SPI_DBG_MAGIC1                   (0x4C4E4B31u)   /* "LNK1" */

/* 主循环阶段码: 每进入一个可能长耗时的段就写一次, 挂死时停在肇事段上(带外 SWD 读槽3)。
 * 20+ 是 APPLY 分支内部的细分阶段, 用来把"APPLY 耗时 13s"落到具体哪一步。 */
#define MLOOP_STAGE_TOP                  (1u)
#define MLOOP_STAGE_LATCH                (2u)
#define MLOOP_STAGE_WAIT_SCAN            (3u)   /* 等 Cy_CapSense_IsBusy 变 NOT_BUSY */
#define MLOOP_STAGE_PROCESS              (4u)
#define MLOOP_STAGE_TOUCH                (5u)
#define MLOOP_STAGE_PUBLISH              (6u)
#define MLOOP_STAGE_MEASURE_CP           (7u)
#define MLOOP_STAGE_ALGO_COMMIT          (8u)
#define MLOOP_STAGE_GLOBAL_APPLY         (9u)
#define MLOOP_STAGE_APPLY                (10u)
#define MLOOP_STAGE_CALIBRATE            (11u)
#define MLOOP_STAGE_BASELINE_RESET       (12u)
#define MLOOP_STAGE_AUTO_TUNE            (13u)
#define MLOOP_STAGE_SCAN_START           (14u)
/* APPLY 分支细分 */
#define MLOOP_STAGE_APPLY_ENABLE         (20u)  /* reserved */
#define MLOOP_STAGE_APPLY_RECAL          (21u)  /* 逐通道 _recalibrate_dirty_channels */
#define MLOOP_STAGE_APPLY_INIT           (22u)  /* Cy_CapSense_Initialize */
#define MLOOP_STAGE_APPLY_BASELINE       (23u)  /* Cy_CapSense_InitializeAllBaselines */

/* 前 5 个 volatile 字段(block+8 .. block+24)是 RP2040 经 SWD 读走的"导出槽", 顺序即上报顺序;
 * 其后的字段仍在内存里累计, 需要时再扩展读取范围即可。
 * ★槽位内容已换代★: 帧对齐问题已由实测证伪(bad_magic 连续两轮为 0, 帧边界完全正确), 故把导出槽
 * 让给当前真正待查的问题 —— PSoC 主循环是否活着、是否在扫描、是否在发布快照。 */
typedef struct
{
    uint32_t magic0;
    uint32_t magic1;
    /* ★槽0/4/5/6 已换代为"钉死 snsClk 被谁改回 8"的四件套★(rx_frames/apply_cmd/apply_last_ms/
     * apply_dirty 的使命已完成: 链路与 APPLY 风暴都已修复且有 scan/ms/stage/setparam 可继续监视)。
     * 判据:
     *   clk_boot==32 且 clk_now==8 且 clk_set_cnt>0  ⇒ 是 SET_PARAM 推下来的(store 侧问题)
     *   clk_boot==32 且 clk_now==8 且 clk_set_cnt==0 ⇒ 是中间件内部路径改的(Init/Initialize/Enable)
     *   clk_boot!=32                                 ⇒ 启动归一根本没生效 */
    volatile uint32_t clk_boot;       /* 槽0: 启动 normalize 之后立刻采样的 widgetContext[0].snsClk */
    volatile uint32_t scan_count_m;   /* 槽1: scan_count 镜像(主循环每完成一次全通道扫描 +1) */
    volatile uint32_t ms_tick_m;      /* 槽2: g_ms_tick 镜像(SysTick 毫秒, 0 说明主循环/时基死了) */
    /* 槽3: 主循环阶段码(见 MLOOP_STAGE_*)。主循环挂死时它就停在肇事阶段上, 带外 SWD 一读即知。 */
    volatile uint32_t stage;
    /* ★钉死 APPLY 问题的四个关键量★
     * 槽4/槽7 回答"帧到底有没有反复到达"(ISR 计数, 与主循环无关):
     *   apply_cmd  持续增长 ⇒ RP2040 真的在反复发 APPLY, 去 RP2040 侧抓发送方;
     *   apply_cmd  恒为 1   ⇒ 没人重发, 那 stage=10 只能是 apply_pending 被别的途径置起。
     *   setparam_cmd 同步增长 ⇒ provision 整体在重复(不只是 APPLY)。
     * 槽5/槽6 回答"13s 花在哪": 上次 APPLY 实测耗时, 以及进入时的脏通道数(逐通道重校准的工作量)。 */
    volatile uint32_t clk_set_cnt;    /* 槽4: cmd_set_param 写 PARAM_SNS_CLK_DIV 的次数 */
    volatile uint32_t clk_set_last;   /* 槽5: 最后一次被写入的 snsClk 值(低16位) | 通道<<16 */
    volatile uint32_t clk_now;        /* 槽6: 每轮主循环采样的 widgetContext[0].snsClk(当前生效值) */
    volatile uint32_t setparam_cmd;   /* 槽7: ISR 收到 SENSOR_CMD_SET_PARAM 的次数 */
    volatile uint32_t snap_pub;
    volatile uint32_t rx_bad_magic;
    volatile uint32_t cs_resync;
    volatile uint32_t rx_leftover;
} spi_dbg_t;
/* 带 magic 常量初值 ⇒ 落在 .data(而非 .bss), 内容确定, SWD 扫描必然能命中。 */
static spi_dbg_t spi_dbg = { SPI_DBG_MAGIC0, SPI_DBG_MAGIC1,
                             0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u };

static inline void _spi_dbg_clear(void)
{
    spi_dbg.magic0 = SPI_DBG_MAGIC0;
    spi_dbg.magic1 = SPI_DBG_MAGIC1;
    spi_dbg.clk_boot = 0u;
    spi_dbg.scan_count_m = 0u;
    spi_dbg.ms_tick_m = 0u;
    spi_dbg.stage = 0u;
    spi_dbg.clk_set_cnt = 0u;
    spi_dbg.clk_set_last = 0u;
    spi_dbg.clk_now = 0u;
    spi_dbg.setparam_cmd = 0u;
    spi_dbg.snap_pub = 0u;
    spi_dbg.rx_bad_magic = 0u;
    spi_dbg.cs_resync = 0u;
    spi_dbg.rx_leftover = 0u;
}

