NKQC/maimai-input-control-firmware/psoc_firmware/CY8C4147AZI-SensorCore/main.c
/* 统计 64 位掩码里的置位数(APPLY 的脏通道工作量)。 */
static inline uint32_t _popcount64(uint64_t v)
{
    uint32_t n = 0u;
    while (v != 0u) { v &= (v - 1u); n++; }
    return n;
}
/* 实时触控帧：主循环每个 capsense 周期更新，DMA 完成 ISR 作为默认响应装入 TX FIFO（流水线）。 */
static volatile uint8_t touch_frame[SENSOR_FRAME_SIZE];
/* APPLY 指令置位，主循环执行重校准（不能在 ISR 里做耗时重扫描）。 */
static volatile bool apply_pending = false;
/* 硬件参数改变后仅记录对应通道，避免 APPLY 为未修改通道重校准造成状态漂移。 */
static volatile uint64_t idac_dirty_mask = 0u;
/* MEASURE_CP 指令置位，主循环执行逐电极 BIST 电容测量(不能在 ISR 里做耗时测量)。 */
static volatile bool measure_cp_pending = false;
/* SET_GLOBAL 置位：全局 CSD 配置(inactive_sns/IDAC/MFS)改动需完整 Init+Initialize 重初始化，
 * 重算内部预计算(csdInactiveSnsDm/HSIOM 见 cy_capsense_sensing.c)。轻量 APPLY 不够，会坏扫描。
 * 主循环执行 Cy_CapSense_Init+Initialize（已验证可用）。 */
static volatile bool global_apply_pending = false;
/* 主循环测量期间保持 true；SPI ISR 据 pending/active 返回 0，避免读到半更新数组。 */
static volatile bool measure_cp_active = false;
/* CALIBRATE 指令置位：主循环执行真正的 IDAC 重校准(不能在 ISR 里做)。 */
static volatile bool calibrate_pending = false;
/* BASELINE_RESET 指令置位：主循环执行基线复位。 */
static volatile bool baseline_reset_pending = false;
/* ★校准/基线的目标通道(单通道语义端到端透传)★ 0..35=只处理该通道, SENSOR_CH_ALL=全 36 通道。
 * 与 auto_tune_ch 完全同构(同一哨兵、同一 rx[2] 位置), 不新增命令码、不造平行协议。
 * ★为什么必须透传★: 上位机点"本通道校准"时原先固件把它扩成 36 通道重校准 —— 既慢(逐通道
 * CalibrateWidget × 36)又会把其它通道刚调好的 IDAC/基线一起冲掉, 与"只调这一个通道"的语义相反。
 * UI 的批量(全通道)现在由 host 侧可取消串行队列逐通道发起, 不再依赖固件内部循环。 */
static volatile uint8_t calibrate_ch = SENSOR_CH_ALL;
static volatile uint8_t baseline_ch = SENSOR_CH_ALL;
/* AUTO_TUNE 指令置位：主循环执行频率自适应下探(逐档升 snsClk 分频重校准)。 */
static volatile bool auto_tune_pending = false;
/* 自适应结果: 0=未执行/进行中, 1=成功(auto_tune_div 为找到的分频), 2=失败(超硬件上限仍压不到目标)。 */
static volatile uint8_t auto_tune_result = 0u;
/* 自适应成功时找到的 snsClk 分频(已写回目标 widgetContext)。
 * ★全通道(0xFF)模式的完成态语义★: 各通道分频互不相同, 单一分频无意义, 故完成时本字段 = 成功通道数
 * (0..36); 真正的逐通道分频由 RP2040 完成后经 GET_PARAM(0x08) 逐通道回读写穿真相源。 */
static volatile uint16_t auto_tune_div = 0u;
/* 本次自适应的目标通道: 0..35=单通道, AUTO_TUNE_CH_ALL=全通道。GET_AUTO_TUNE 回显该字节。 */
static volatile uint8_t auto_tune_ch = AUTO_TUNE_CH_ALL;
/* 本次自适应的灵敏度偏好档位(1..7, 默认 4=居中): 落档时在临界分频上加 2*(pref-1)(往低频=更灵敏)。 */
static volatile uint8_t auto_tune_pref = 4u;
/* ★阶段性进度★: 长自适应(最坏 ~20s)期间由主循环逐步更新, 经 GET_AUTO_TUNE 的 progress 字节上报,
 * 使 RP2040/上位机在过程中就能看到"到哪一步了", 而非只能干等最终结果。
 * phase: 0=空闲/已受理 1=粗定位 2=细搜临界 3=落档/回退 4=完成; step: 该阶段内步序(1 起, 上报饱和 31)。
 * SPI 是独立中断且优先级(2)高于 CapSense(3), 故校准阻塞期间 ISR 仍能应答这两个量。 */
static volatile uint8_t auto_tune_phase = 0u;
static volatile uint8_t auto_tune_step = 0u;
/* ★本轮请求标签(6 bit)★: AUTO_TUNE 帧 rx[4] 带下来的"这条命令属于上位机哪一次请求"的标记,
 * 由 GET_AUTO_TUNE 的 result 字节高 6 位原样回显(result 只用 0/1/2, 高 6 位本来空着 ——
 * 这是扩展既有响应字段, 不新增命令码, 不造平行协议)。
 * ★为什么需要它★: RP2040 侧"发命令→轮询 busy→读结果"的流水线里, 若本条 AUTO_TUNE 其实没被
 * 本 ISR 收到(SPI 丢帧, 而 busy 恰好因上一条重操作为 1), 读回来的就是**上一轮**的 result/div,
 * 却会被当成本轮成功。标签不匹配即可当场认出这种陈旧结果。0 = 未标记(旧 RP 固件)。 */
static volatile uint8_t auto_tune_tag = 0u;
#define AUTO_TUNE_TAG_MASK               (0x3Fu)
#define AUTO_TUNE_RESULT_MASK            (0x03u)
#define AUTO_TUNE_PHASE_IDLE             (0u)
#define AUTO_TUNE_PHASE_COARSE           (1u)
#define AUTO_TUNE_PHASE_FINE             (2u)
#define AUTO_TUNE_PHASE_SETTLE           (3u)
#define AUTO_TUNE_PHASE_DONE             (4u)
#define AUTO_TUNE_STEP_MAX_REPORT        (31u)
/* 细搜(1 步进上探临界)最大步数: 粗表最大相邻间隔为 48→64 的 16, 取 15 步即可覆盖整个区间;
 * 同时限制全通道模式下额外校准次数(单次全通道校准 ~200-270ms), 保证总耗时留在 RP2040 的 10s 窗内。 */
#define AUTO_TUNE_FINE_STEPS_MAX         (15u)
/* ★处理中锁定/真实完成反馈★：ISR 收到 APPLY/CALIBRATE/BASELINE_RESET/GLOBAL_COMMIT 即置 1,
 * 主循环把对应重操作真正做完后清 0。经 GET_STATS 响应 byte[2] 上报, 供 RP2040 轮询至真实完成
 * (替代原固定 sleep 盲等), 上位机据此显示"处理中"并在真正完成后解锁/刷新, 而非命令一到就误判完成。 */
static volatile uint8_t g_op_busy = 0u;
/* 任一通道的 JIT 算法【显式请求点灯】(io->out_led != 0)。白 LED 的唯一运行时来源。
 * 固件不再从触控判定(out_active)推导灯态 —— 没有算法、或算法不写 out_led 时白灯恒灭。 */
static volatile bool g_any_active = false;
/* 全局"是否自动校准"运行时开关(GPARAM_AUTO_CALIBRATE_EN, 默认开)。开=Init/Apply 走 Enable 自动校准 IDAC;
 * 关=只 Initialize+基线复位, 用固定 IDAC(配置/手动值)换取稳定灵敏度范围(修某些通道自动校准发散 railed)。
 * "校准"命令(SENSOR_CMD_CALIBRATE)始终执行一次显式校准, 不受本开关影响(满足"点校准=单次校准"需求)。 */
static volatile bool g_auto_calibrate = true;
/* 每通道最近一次寄生电容测量值(fF)，0xFFFFFF=失败/未测量。 */
static volatile uint32_t cp_value[SENSOR_CHANNEL_COUNT];
/* CSD 处理模式：SCAN_MODE_AUTO(自动校准/标准完整处理) / SCAN_MODE_SEMI(半自动手动)。 */
static volatile uint8_t scan_mode = SCAN_MODE_AUTO;
/* ★通道启用位图(bit ch = 1 启用)★ 默认全 36 通道启用。
 * ★为什么不用 Cy_CapSense_SetPinState(HIGHZ) 去"关"一个仍在被扫描的 widget★
 * 那只能撑到下一轮扫描: ScanAllWidgets → CSDSetupWidget → CSDConnectSns 会把电极重新挂回
 * AMUXBUS(cy_capsense_csd_v2.c), 于是"关掉的通道"每轮都被重新连一次 —— 那是"UI 显示关闭但硬件
 * 仍在扫"的伪实现。
 * ★真正的关★ 用中间件自带的 widget-enable(CY_CAPSENSE_WD_ENABLE_MASK):
 *   Cy_CapSense_SetupWidget(sensing_v2.c:180) 先查 Cy_CapSense_IsWidgetEnabled, 不启用即返回
 *   BAD_PARAM; Cy_CapSense_ScanAllWidgets_V2 只 setup 第一个成功的 widget, 而链式推进的
 *   Cy_CapSense_SsPostAllWidgetsScan(sensing_v2.c:1604) 对失败的 widget **直接 skip**。
 *   ⇒ 禁用的 widget 永久不进入扫描序列, 从不被 CSDConnectSns 连接。
 * ★电气契约★ INACTIVE_SNS 是 Host 可选的 GND / High-Z / Shield，而非禁用通道的 High-Z 保证。
 *   Cy_CapSense_SsInitialize 会先将全部 IO 设为 STRONG_IN_OFF，CSDInitialize 又会按当前全局
 *   inactive 配置 blanket 全部电极；故每次 CSD 模式准备完成后都由
 *   _disabled_widgets_force_highz() 显式复位禁用 widget 的全部电极。
 * ★注意★ 只有 Cy_CapSense_Init(cy_capsense_control.c:147) 会把全部 widget 的 ENABLE|WORKING
 *   重新置起; Initialize/Enable 只清 ACTIVE 位(processing.c:126)不动 ENABLE。故需在 Init 之后
 *   重放本位图(见 _ch_enable_restore)。 */
#define CH_ENABLED_ALL                   (((uint64_t)1u << SENSOR_CHANNEL_COUNT) - 1u)
#define PROVISION_TIMEOUT_MS             (3000u)
/* PSoC 启动时先禁用全部 widget。RP 下发完整 enabled 位图后再用既有 APPLY 作为完成屏障；
 * 旧 RP 未发送该位图时，超时回退为全启用。禁用电极的 High-Z 由显式 helper 保证，
 * 不依赖 Host 可配置的 CSD inactive 状态。 */
static volatile uint64_t g_ch_enabled = 0u;
static volatile uint64_t g_provision_enable_seen = 0u;
static volatile bool g_provision_pending = true;
static volatile bool g_provision_apply_release = false;
/* 启用态刚被 SPI 改动、尚未由主循环落到中间件的通道位图(ISR 只置位, 重活在主循环)。 */
static volatile uint64_t ch_enable_dirty = 0u;

static inline bool _ch_is_enabled(uint32_t ch)
{
    return (ch < SENSOR_CHANNEL_COUNT) &&
           ((g_ch_enabled & ((uint64_t)1u << ch)) != 0u);
}

static inline bool _any_ch_enabled(void)
{
    return (g_ch_enabled & CH_ENABLED_ALL) != 0u;
}
static volatile uint32_t scan_count = 0u;  // 每完成一次全通道扫描 +1，自由递增(无触摸也增长)
static uint8_t snapshot_buffers[2u][SENSOR_SNAPSHOT_SIZE];
static uint16_t snapshot_generations[2u];
static volatile uint8_t published_snapshot_index;
static volatile bool published_snapshot_valid;
static uint8_t transfer_snapshot[SENSOR_SNAPSHOT_SIZE];
static uint16_t transfer_generation;
static bool transfer_valid;

