NKQC/maimai-input-control-firmware/psoc_firmware/CY8C4147AZI-SensorCore/main.c
/* ---- JIT 可加载触控算法引擎（ABI v1，见 psoc_algo_abi.h）----
 * algo_slot：可执行 1KB RAM 槽，4 字节对齐（Cortex-M0+ 从 SRAM 取指，thumb 入口 |1）。
 * algo_staging：ALGO_PAGE 写入的暂存区；ALGO_END 只置 pending，由主循环校验 CRC16 后 commit。 */
static uint8_t algo_slot[ALGO_SLOT_SIZE] __attribute__((aligned(4)));
static uint8_t algo_staging[ALGO_SLOT_SIZE];
static volatile bool algo_valid = false;
static volatile uint16_t algo_len = 0u;
/* ALGO_BEGIN 声明的期望长度；ALGO_PAGE 越界保护用。 */
static volatile uint16_t algo_expected_len = 0u;
/* 主循环 commit 状态机：ISR 只置位，真正的 CRC 校验 + memcpy 由主循环执行。 */
static volatile bool algo_commit_pending = false;
static volatile uint16_t algo_commit_crc = 0u;
/* 逐通道持久 IO 记录：状态字段跨周期原地保留，仅输入字段每周期刷新。 */
static algo_io_t g_algo_io[SENSOR_CHANNEL_COUNT];
/* 记录上一周期各通道 base_active，用于检测非激活→激活边沿以清零 state[]。 */
static uint8_t algo_prev_active[SENSOR_CHANNEL_COUNT];
/* 每通道 16 位 ROM：上位机随算法下发的只读常量(如 per-channel fingerCap/Cp/阈值)，
 * 每周期填入 io->rom 供算法读取。算法不写。ALGO_SET_ROM/GET_ROM 读写。 */
static volatile uint16_t g_algo_rom[SENSOR_CHANNEL_COUNT];
/* 共享算法可设置变量(ABI cfg[8]): 上位机经 ALGO_SET_CFG 下发, 每次算法执行前拷入 io->cfg。
 * 供算法运行时可调参数(如基线偏移、阈值系数等), 上位机按源码声明的名字+默认值展示为可调项。 */
static volatile uint8_t g_algo_cfg[8] = {0u};
/* 毫秒计时：SysTick 每 1ms 回调递增。真实 ms 源，见 systick_ms_callback()。 */
static volatile uint32_t g_ms_tick = 0u;

/* 全局 CSD 配置 RAM 影子：生成的 cy_capsense_commonConfig 是 const(flash)不可运行时改，
 * 故 init 前把它拷到 RAM 并把 cy_capsense_context.ptrCommonConfig 指向此副本；
 * 之后 SET_GLOBAL 改此副本、APPLY 重初始化时中间件从 ptrCommonConfig 重算内部预计算而生效。 */
static cy_stc_capsense_common_config_t g_common_cfg_ram;
/* 启动时固件强制改写过哪些生成配置项(位掩码, 经 GPARAM_BOOT_OVERRIDE 只读上报)。
 * 有值即说明"设备实际配置 != 用户/生成配置给的值", 上位机必须据此告警, 不许静默不同步。 */
static uint8_t g_boot_override = 0u;

static void spi_slave_task(uint8_t rx_index);
static void spi_dma_isr(void);
static void spi_cs_isr(void);
static void spi_dma_init(void);
static void spi_dma_arm_tx(void);
static void spi_snapshot_latch_task(void);
/* 启用位图 → 中间件 widget 状态的重放。定义在参数区(见 _ch_enable_restore 处的说明), 但
 * initialize_capsense 里 Cy_CapSense_Init 之后就要用它, 故在此前置声明。 */
static inline void _ch_enable_restore(void);
static inline void _disabled_widgets_force_highz(void);
static inline void _prepare_csd_mode(void);

static void capsense_isr(void)
{
    Cy_CapSense_InterruptHandler(CYBSP_CSD_HW, &cy_capsense_context);
}

/* SysTick 1ms 回调：唯一的 g_ms_tick 写者，运行时真实毫秒时间戳来源。 */
static void systick_ms_callback(void)
{
    g_ms_tick++;
}

static void initialize_ms_tick(void)
{
    /* SysTick 用 CPU 时钟，1ms 周期：reload = SystemCoreClock/1000 - 1。 */
    uint32_t reload = (SystemCoreClock / 1000u);
    if (reload > 0u) { reload -= 1u; }
    Cy_SysTick_Init(CY_SYSTICK_CLOCK_SOURCE_CLK_CPU, reload);
    (void)Cy_SysTick_SetCallback(0u, systick_ms_callback);
}

/* CRC16-CCITT-FALSE：poly=0x1021, init=0xFFFF，覆盖 data[0,len)。用于算法 blob 上传校验。 */
static uint16_t algo_crc16(const uint8_t *data, uint16_t len)
{
    uint16_t crc = 0xFFFFu;
    uint16_t i;
    for (i = 0u; i < len; i++)
    {
        uint8_t byte = data[i];
        uint8_t bit;
        crc ^= (uint16_t)((uint16_t)byte << 8u);
        for (bit = 0u; bit < 8u; bit++)
        {
            crc = (uint16_t)((crc & 0x8000u) ? ((crc << 1u) ^ 0x1021u) : (crc << 1u));
        }
    }
    return crc;
}

/* ★用户手动 IDAC 增益档锁定★: 中间件的校准(Cy_CapSense_CalibrateAllWidgets/CalibrateWidget,
 * 见 cy_capsense_csd_v2.c 校准入口)与 Cy_CapSense_Enable 一进来就把 widgetContext[ch].idacGainIndex
 * 无条件拉回全局起点档 csdIdacGainInitIndex, 于是用户经 PARAM_IDAC_GAIN 设的增幅被静默改回 ——
 * 上位机显示与设备实际不符。故记录"用户显式设过的通道 + 其值", 在所有会重置增益档的动作之后恢复。
 * 语义: 显式 PARAM_IDAC_GAIN 即锁定该通道; 修改全局 GPARAM_IDAC_GAIN_INIT 视为用户改了起点档 →
 * 清空全部锁定(以全局值为准)。GET_PARAM 恒读 widgetContext 实际生效值。 */
typedef struct
{
    uint64_t mask;                        /* bit ch = 该通道增益档被用户锁定 */
    uint8_t  gain[SENSOR_CHANNEL_COUNT];  /* 锁定通道的用户增益档(0..6) */
} idac_gain_lock_t;
static volatile idac_gain_lock_t g_idac_lock;

static inline void _idac_lock_clear(void)
{
    uint32_t i;
    g_idac_lock.mask = 0u;
    for (i = 0u; i < SENSOR_CHANNEL_COUNT; i++) { g_idac_lock.gain[i] = 0u; }
}

/* 把锁定通道的增益档写回 widgetContext。target 为 0..35 时只恢复该 widget，
 * SENSOR_CH_ALL 时恢复全部锁定 widget。CSDv2 会在下一次 ScanWidget 内部装载该 widget 的
 * idacGainIndex，故这里绝不调用全局 Initialize/SsInitialize 破坏其它 widget 的运行状态。 */
static inline bool _idac_lock_restore(uint8_t target)
{
    const uint32_t first = (target < SENSOR_CHANNEL_COUNT) ? target : 0u;
    const uint32_t last = (target < SENSOR_CHANNEL_COUNT) ? ((uint32_t)target + 1u) : SENSOR_CHANNEL_COUNT;
    uint32_t w;
    bool changed = false;
    if (g_idac_lock.mask == 0u) { return false; }
    for (w = first; w < last; w++)
    {
        if ((g_idac_lock.mask & ((uint64_t)1u << w)) != 0u)
        {
            cy_stc_capsense_widget_context_t * wc = &cy_capsense_tuner.widgetContext[w];
            if (wc->idacGainIndex != g_idac_lock.gain[w])
            {
                wc->idacGainIndex = g_idac_lock.gain[w];
                changed = true;
            }
        }
    }
    return changed;
}

/* ★逐通道校准必须在"该通道自己的增益档"下进行★
 * cy_capsense_csd_v2.c:1713 的 CalibrateWidget 一进来就 idacGainIndex = csdIdacGainInitIndex(全局
 * 起点档), auto-gain 之后只会往低档走 —— 于是"用户给该通道设的 PARAM_IDAC_GAIN"在校准过程中被
 * 全局档顶替: 解出的 idacMod 属于全局档, 事后 _idac_lock_restore 又把档改回用户值, 二者不自洽
 * (频率自适应尤其明显: 每一档试探的通过/失败判定都用的全局档, 找到的分频对不上该通道的档)。
 * 故 per-channel 校准统一走本助手: 锁定通道把全局起点档临时替换为该通道的锁定档, 校准后还原,
 * 使中间件的强制复位正好落在该通道自己的档上(语义 = 该通道的起点档)。未锁定通道零行为变化。 */
static inline bool _calibrate_widget_locked(uint32_t ch)
{
    bool ok;
    uint8_t saved_init = g_common_cfg_ram.csdIdacGainInitIndex;
    const bool locked = (ch < SENSOR_CHANNEL_COUNT) &&
                        ((g_idac_lock.mask & ((uint64_t)1u << ch)) != 0u);
    if (locked) { g_common_cfg_ram.csdIdacGainInitIndex = g_idac_lock.gain[ch]; }
    ok = (CY_CAPSENSE_STATUS_SUCCESS == Cy_CapSense_CalibrateWidget(ch, &cy_capsense_context));
    /* 只在字段仍是我们写进去的临时值时还原: 校准期间 SPI ISR 若受理了 GPARAM_IDAC_GAIN_INIT,
     * 盲目还原会把用户刚设的新全局起点档冲掉。 */
    if (locked && (g_common_cfg_ram.csdIdacGainInitIndex == g_idac_lock.gain[ch]))
    {
        g_common_cfg_ram.csdIdacGainInitIndex = saved_init;
    }
    return ok;
}

/* 自动校准/Enable 之后恢复全部锁定档。每个 widget 的下一次扫描会从它自己的
 * widgetContext 装载 IDAC，不能为此触发全局 Initialize 或重置其它通道基线。 */
static inline void _idac_lock_reapply(void)
{
    (void)_idac_lock_restore(SENSOR_CH_ALL);
}

/* 建立全局配置 RAM 影子并重定向 ptrCommonConfig。必须在 Cy_CapSense_Init 前调用。 */
static void initialize_common_cfg_shadow(void)
{
    memcpy(&g_common_cfg_ram, cy_capsense_context.ptrCommonConfig, sizeof(g_common_cfg_ram));

    /* ★编译时 IDAC 增强(修复 raw 满量程 railed)★：生成配置默认 IDAC 增益档=0, 补偿电流过小,
     * 启动 Cy_CapSense_Enable 的自动校准无法把 raw 拉离满量程 → 全通道 raw=maxRawCount/diff=0(不可用)。
     * 实测增益档 4 时自动校准收敛到 ~RAW_TARGET(85%)。此处在【首次 Init 前】写 RAM 影子, 使启动
     * Enable 首扫即用增益 4 干净校准(无需运行时 DeInit 重配, 避开运行时改时钟致 15Hz 的降速 bug)。
     * 运行时仍可经 GLOBAL_SET(IDAC_GAIN_INIT) / PARAM_SET(IDAC_GAIN) 覆盖。 */
    if (g_common_cfg_ram.csdIdacGainInitIndex < 4u) {
        g_common_cfg_ram.csdIdacGainInitIndex = 4u;
        g_boot_override |= 0x01u;
    }
    /* ★只拦真正非法值★: 运行时 cmd_set_global 放行 1..99, 这里原先却夹到 [60,90], 于是用户设的
     * 50 每次启动被静默改成 85 —— 上位机显示 50、设备实际 85, 长期不同步。现在与运行时同口径,
     * 只有 0 / >=100(会让自动校准发散→railed)才回退默认。被改写时置位经 GPARAM_BOOT_OVERRIDE 上报。 */
    if ((g_common_cfg_ram.csdRawTarget == 0u) || (g_common_cfg_ram.csdRawTarget >= 100u)) {
        g_common_cfg_ram.csdRawTarget = 85u;
        g_boot_override |= 0x02u;
    }
    /* ★出厂默认(ROM)的 GND 在本 36 通道面板上不可用, 故只改"默认", 不改"用户选择"★
     * GND 让 35 个非激活电极接地, 每通道多约 4.3ms 固定建立开销(实测 172.5µs → 4386µs/通道),
     * 叠加 MFS 三频后实测整轮扫描约 833ms(1.2Hz), UI 上表现为"实测探测周期 1000ms / 期望 5.8ms,
     * 倍率 ×172"且 raw 全通道同值不抖 —— 这就是采样异常的直接成因。
     * ★与之前"不得静默替用户决定"的结论并不矛盾★: 那条针对的是【用户已选 GND】被启动改写;
     * 而这里改的是【生成配置的出厂默认】—— store 为空时用户根本还没做过选择, 落在不可用的默认上
     * 只会让"恢复默认"救不回来(空 store → GND → 采样不可信 → 拒绝固化基线 → 永远卡住)。
     * 用户显式选择仍由 store 的 GLOBAL_SET(INACTIVE_SNS) 在 provision 时覆盖本默认, 优先级更高。
     * 被改写时置位, 经 GPARAM_BOOT_OVERRIDE 上报, UI 可见, 不是静默行为。 */
    if (g_common_cfg_ram.csdInactiveSnsConnection == (uint8_t)CY_CAPSENSE_SNS_CONNECTION_GROUND) {
        g_common_cfg_ram.csdInactiveSnsConnection = (uint8_t)CY_CAPSENSE_SNS_CONNECTION_HIGHZ;
        g_boot_override |= 0x04u;
    }

    cy_capsense_context.ptrCommonConfig = &g_common_cfg_ram;
}

/* 写全局 CSD 配置到 RAM 影子(运行时可配项)。改后需 APPLY 重初始化生效。 */
static void cmd_set_global(uint8_t gparam_id, uint32_t value)
{
    switch (gparam_id)
    {
        case GPARAM_INACTIVE_SNS:
            /* GND 会把未激活电极接地，显著增加被测电极对地寄生电容，转换建立时间随之拉长；
             * 36 段面板的扫描周期可从约 6ms 暴涨到 142–200ms，且更易 raw railed。仍允许用户显式选择，
             * 但面板默认应使用 High-Z(2)。 */
            if ((value == 1u) || (value == 2u) || (value == 4u))
            {
                g_common_cfg_ram.csdInactiveSnsConnection = (uint8_t)value;
            }
            break;
        /* 防护: IDAC 增益档 0..7; IDAC min 0..127(7位); 校准目标 1..99%(0/≥100 会让自动校准发散→railed)。 */
        /* IDAC 增益档合法索引 0..6(idacGainTable 共 CY_CAPSENSE_IDAC_GAIN_NUMBER=7 项), 索引7越界会读
         * 到表外 gainReg → 写非法 IDAC → 扫描挂死/看门狗复位(崩溃)。夹到 <=6。 */
        /* 改起点档 = 用户重新给定全局增益基准 → 清空全部手动锁定, 以全局值为准。 */
        case GPARAM_IDAC_GAIN_INIT: if (value <= 6u)   { g_common_cfg_ram.csdIdacGainInitIndex = (uint8_t)value; _idac_lock_clear(); } break;
        case GPARAM_IDAC_MIN:       if (value <= 127u) { g_common_cfg_ram.csdIdacMin           = (uint8_t)value; } break;
        case GPARAM_RAW_TARGET:     if ((value >= 1u) && (value <= 99u)) { g_common_cfg_ram.csdRawTarget = (uint8_t)value; } break;
        /* ★补齐缺失的围栏★: 这两项原先无任何检查, 直接 (uint8_t)value 截断 —— 上位机写 300
         * 会被静默变成 44, 而 SET_GLOBAL 的回显以前送回的是"请求值"而非"存储值", 于是上位机
         * 完全看不出失败(唯一一条静默限制路径, 其余非法值都由 RP2040 侧 NAK 拦下)。
         * 现在与其它项同口径: 超范围直接不写, 保持原值, 由回显的存储值让上位机据实回读。 */
        case GPARAM_MFS_DIV_F1:     if (value <= 255u) { g_common_cfg_ram.csdMfsDividerOffsetF1 = (uint8_t)value; } break;
        case GPARAM_MFS_DIV_F2:     if (value <= 255u) { g_common_cfg_ram.csdMfsDividerOffsetF2 = (uint8_t)value; } break;
        /* IDAC 感应配置(sourcing/sinking): 运行时可设的充电方向, 影响灵敏度极性/范围。 */
        case GPARAM_IDAC_SENSE_CONFIG: g_common_cfg_ram.csdChargeTransfer = (value != 0u) ? (uint8_t)CY_CAPSENSE_IDAC_SINKING : (uint8_t)CY_CAPSENSE_IDAC_SOURCING; break;
        /* ★由关转开必须立刻做一次真实校准★: 原生 CapSense 的"IDAC 自动校准"语义是
         * Enable/Init 时按 csdRawTarget 解出各通道 IDAC。此前本项只改标志, 要等下一次 APPLY 才
         * 生效, 且半自动手动模式下只补校"脏通道" —— 用户勾选后没有任何参数变更时 dirty 为空,
         * 表现为"勾了不拉基线、IDAC 根本没运行"。故 0→1 沿置 calibrate_pending, 由主循环执行
         * CalibrateAllWidgets + InitializeAllBaselines(等价于原生 Enable 的自动校准结果)。
         * 只在上升沿触发: 重复写 1 不该反复打断扫描。 */
        case GPARAM_AUTO_CALIBRATE_EN:
            if ((value != 0u) && !g_auto_calibrate) { calibrate_pending = true; }
            g_auto_calibrate = (value != 0u);
            break;
        default: break;
    }
    /* 仅改影子, 不在此重初始化。全部全局项设完后由 GLOBAL_COMMIT 触发一次完整重初始化,
     * 避免每项都重初始化导致 SmartSense 反复重校准的漂移/降速(实测会致 8Hz/raw 饱和)。 */
}

static uint32_t cmd_get_global(uint8_t gparam_id)
{
    switch (gparam_id)
    {
        case GPARAM_INACTIVE_SNS:   return g_common_cfg_ram.csdInactiveSnsConnection;
        case GPARAM_IDAC_GAIN_INIT: return g_common_cfg_ram.csdIdacGainInitIndex;
        case GPARAM_IDAC_MIN:       return g_common_cfg_ram.csdIdacMin;
        case GPARAM_RAW_TARGET:     return g_common_cfg_ram.csdRawTarget;
        case GPARAM_MFS_DIV_F1:     return g_common_cfg_ram.csdMfsDividerOffsetF1;
        case GPARAM_MFS_DIV_F2:     return g_common_cfg_ram.csdMfsDividerOffsetF2;
        case GPARAM_IDAC_SENSE_CONFIG: return (g_common_cfg_ram.csdChargeTransfer == (uint8_t)CY_CAPSENSE_IDAC_SINKING) ? 1u : 0u;
        case GPARAM_AUTO_CALIBRATE_EN: return g_auto_calibrate ? 1u : 0u;
        case GPARAM_BOOT_OVERRIDE:  return g_boot_override;
        /* SPI 链路只读诊断(24 位截断足够: 这些计数在秒级量级内远小于 16M)。 */
        case GPARAM_DBG_RX_FRAMES:    return spi_dbg.clk_now      & 0xFFFFFFu;
        case GPARAM_DBG_RX_BAD_MAGIC: return spi_dbg.rx_bad_magic & 0xFFFFFFu;
        case GPARAM_DBG_CS_RESYNC:    return spi_dbg.cs_resync     & 0xFFFFFFu;
        case GPARAM_DBG_TX_ARM:       return spi_dbg.clk_set_cnt   & 0xFFFFFFu;
        case GPARAM_DBG_RX_LEFTOVER:  return spi_dbg.rx_leftover   & 0xFFFFFFu;
        default: return 0u;
    }
}

/* ★通道参数归一(修"不同通道分辨率口径不一样")★: 生成配置源自 buttons+slider 示例,
 * widget 0-2 为 resolution=10/snsClk=8, widget 3-35 为 resolution=12/snsClk=4(不均匀) →
 * 各通道 raw 满量程口径不同(1023 vs 4095)、灵敏度/时钟不一致, 校准与显示都错乱。
 * 本工程面板是 36 段均匀触控, 必须统一。此处把全部 widget 归一到统一分辨率(12)+时钟分频(8),
 * 使全通道口径一致、首次 Enable 自动校准(auto-gain)在统一基准上收敛。运行时仍可经 SET_PARAM 覆盖。
 * ★snsClk=32★: 本工程面板 Cp 高(~100pF)。实测 div=8 时传感器在高频下来不及建立→raw 饱和在高位、
 * 无 headroom(全通道 frozen 无抖动)且校准压不到低目标%; div=32 时全 36 通道校准准确跟踪 25%~85%
 * 目标且均有抖动(--calib-track 实测)。故默认降频到 32。运行时可经频率自适应(AUTO_TUNE)进一步下探。 */
static void normalize_widget_params(void)
{
    uint32_t w;
    for (w = 0u; w < SENSOR_CHANNEL_COUNT; w++)
    {
        cy_stc_capsense_widget_context_t * wc = &cy_capsense_tuner.widgetContext[w];
        wc->resolution = 12u;
        wc->snsClk     = 32u;
    }
}

/* ★保全逐通道硬件口径, 抵消 Init 的 ROM 重铺★
 * Cy_CapSense_Init()(内部 Restore)会把整个 widgetContext 从生成配置重铺, 于是运行时的
 * resolution/snsClk 被打回生成值(widget0-2: res=10/clk=8, widget3-35: res=12/clk=4)。
 * 后果就是"DIV 异常固化": 每次全局应用后分频又变回 8, 高频下传感器建立不足 → raw 逼近满量程、
 * 且各通道满量程口径不一致。这里在 Init 前后成对调用即可保全【当前生效值】——
 * 既保住启动归一的 32, 也保住用户 SET_PARAM / AUTO_TUNE 的逐通道分频(不能像归一那样一律冲成 32)。
 * 与 _idac_lock_save/restore 是同一模式, 只是管的字段不同。 */
typedef struct
{
    uint16_t resolution;
    uint16_t sns_clk;
} widget_hw_t;

static widget_hw_t g_widget_hw[SENSOR_CHANNEL_COUNT];

static inline void _widget_hw_save(void)
{
    uint32_t w;
    for (w = 0u; w < SENSOR_CHANNEL_COUNT; w++)
    {
        g_widget_hw[w].resolution = cy_capsense_tuner.widgetContext[w].resolution;
        g_widget_hw[w].sns_clk    = cy_capsense_tuner.widgetContext[w].snsClk;
    }
}

static inline void _widget_hw_restore(void)
{
    uint32_t w;
    for (w = 0u; w < SENSOR_CHANNEL_COUNT; w++)
    {
        cy_capsense_tuner.widgetContext[w].resolution = g_widget_hw[w].resolution;
        cy_capsense_tuner.widgetContext[w].snsClk     = g_widget_hw[w].sns_clk;
    }
}

