NKQC/maimai-input-control-firmware/psoc_firmware/CY8C4147AZI-SensorCore/main.c
static void initialize_capsense(void)
{
    cy_stc_sysint_t capsense_interrupt_config =
    {
        .intrSrc = CYBSP_CSD_IRQ,
        .intrPriority = CAPSENSE_INTR_PRIORITY,
    };

    if (CY_CAPSENSE_STATUS_SUCCESS == Cy_CapSense_Init(&cy_capsense_context))
    {
        Cy_SysInt_Init(&capsense_interrupt_config, capsense_isr);
        NVIC_ClearPendingIRQ(capsense_interrupt_config.intrSrc);
        NVIC_EnableIRQ(capsense_interrupt_config.intrSrc);
        normalize_widget_params();   /* 首次校准(Enable)前把全部通道分辨率/时钟归一, 消除口径不一致 */
        /* Init 刚把全部 widget 置成 ENABLE|WORKING；启动位图仍是全禁用，先重放到中间件。
         * Enable 内部仍会把所有 IO 强推到默认态；返回后必须显式恢复禁用电极的 High-Z。 */
        _ch_enable_restore();
        Cy_CapSense_Enable(&cy_capsense_context);
        _prepare_csd_mode();
        /* 归一 + Enable 之后立刻取样: 这就是"启动结束时真正生效的分频", 供带外 SWD 判定
         * 32 是否连启动都没活下来(见 spi_dbg.clk_boot 注释的判据表)。 */
        spi_dbg.clk_boot = cy_capsense_tuner.widgetContext[0].snsClk;
    }
}

static void snapshot_write_u16(uint8_t * destination, uint16_t value)
{
    destination[0] = (uint8_t)(value & 0xFFu);
    destination[1] = (uint8_t)((value >> 8u) & 0xFFu);
}

static void publish_capsense_snapshot(void)
{
    uint8_t current_index = published_snapshot_index;
    uint8_t next_index = (uint8_t)(current_index ^ 1u);
    uint8_t * destination = snapshot_buffers[next_index];
    uint32_t channel;

    for (channel = 0u; channel < SENSOR_CHANNEL_COUNT; channel++)
    {
        const cy_stc_capsense_sensor_context_t * sensor =
            &cy_capsense_context.ptrWdConfig[channel].ptrSnsContext[0u];
        uint32_t offset = channel * SENSOR_BYTES_PER_CHANNEL;

        /* ★禁用通道一律发布全 0★ 它已不参与扫描, sensor->raw/bsln 仍是关闭前的陈旧值 ——
         * 原样上报会让上位机把"关掉的通道"显示成一条恒定不动的假读数(还会被停滞检测判成异常)。
         * 全 0 是明确的"无数据"约定(status=0 ⇒ 未触摸), 与上位机的灰显一致。 */
        if (!_ch_is_enabled(channel))
        {
            snapshot_write_u16(&destination[offset], 0u);
            snapshot_write_u16(&destination[offset + 2u], 0u);
            snapshot_write_u16(&destination[offset + 4u], 0u);
            destination[offset + 6u] = 0u;
            continue;
        }
        snapshot_write_u16(&destination[offset], sensor->raw);
        snapshot_write_u16(&destination[offset + 2u], sensor->bsln);
        snapshot_write_u16(&destination[offset + 4u], sensor->diff);
        destination[offset + 6u] = sensor->status;
    }

    spi_dbg.snap_pub++;
    snapshot_generations[next_index] = (uint16_t)(snapshot_generations[current_index] + 1u);
    if (snapshot_generations[next_index] == 0u)
    {
        snapshot_generations[next_index] = 1u;
    }

    {
        uint32_t interrupt_state = Cy_SysLib_EnterCriticalSection();
        published_snapshot_index = next_index;
        published_snapshot_valid = true;
        Cy_SysLib_ExitCriticalSection(interrupt_state);
    }
}

/* 用可加载算法 blob 逐通道计算激活位。返回 0/1。仅在 algo_valid 时被调用；
 * 坏 blob 死循环由 RP2040 侧 PONG 心跳兜底硬复位处理(见设计文档 §1)，PSoC 端不需看门狗。 */
static uint32_t algo_engine_run_channel(uint32_t ch, uint32_t base_active)
{
    const cy_stc_capsense_sensor_context_t * sensor =
        &cy_capsense_context.ptrWdConfig[ch].ptrSnsContext[0u];
    const cy_stc_capsense_widget_context_t * wc = &cy_capsense_tuner.widgetContext[ch];
    algo_io_t * io = &g_algo_io[ch];
    algo_fn_t algo_fn = (algo_fn_t)(void *)((uintptr_t)algo_slot | 1u);

    /* 非激活→激活边沿：清零持久 state，供算法重新累积包络/滤波历史。 */
    if ((base_active != 0u) && (algo_prev_active[ch] == 0u))
    {
        memset(io->state, 0, sizeof(io->state));
    }
    algo_prev_active[ch] = (uint8_t)base_active;

    io->baseline     = sensor->bsln;
    io->diff         = sensor->diff;
    io->raw          = sensor->raw;
    io->noise_th     = wc->noiseTh;
    io->nnoise_th    = wc->nNoiseTh;
    io->max_raw      = (wc->maxRawCount != 0u) ? wc->maxRawCount : 1024u;
    io->finger_th    = wc->fingerTh;
    io->base_active  = (uint16_t)base_active;
    io->now_ms       = g_ms_tick;
    io->ch           = ch;
    io->rom          = g_algo_rom[ch];   /* 每通道只读 ROM(上位机下发) */
    /* cfg[8] 全通道共享的可设置变量(上位机 ALGO_SET_CFG 下发)。 */
    for (uint32_t k = 0u; k < 8u; k++) { io->cfg[k] = g_algo_cfg[k]; }

    /* 每轮先清点灯请求, 由算法重新声明: 否则换成不写 out_led 的算法后, 上一个算法(如 LED 演示)
     * 留下的 1 会让白灯永久亮着 —— 那又变成了"用户改不掉的灯"。 */
    io->out_led = 0u;

    algo_fn(io);
    return io->out_active;
}

/* 从 capsense 上下文计算 36 区 on/off 位图，更新触控帧（临界区保护，防 SPI ISR 读到半更新）。 */
static void update_touch_frame(void)
{
    uint8_t mask[5] = {0u, 0u, 0u, 0u, 0u};
    uint32_t ch;
    uint32_t st;
    bool use_algo = algo_valid;
    /* 点灯请求只来自算法显式写入的 out_led; 与触控判定(out_active)彻底解耦。 */
    bool algo_led = false;

    for (ch = 0u; ch < SENSOR_CHANNEL_COUNT; ch++)
    {
        uint32_t base_active;
        uint32_t active;

        /* ★禁用通道恒不触发★ 它不参与扫描也不参与处理, 既不该出现在触控掩码里, 也不该让
         * 上一次的算法状态继续跑(那会让关闭的通道仍能点灯/仍能报按下)。 */
        if (!_ch_is_enabled(ch))
        {
            g_algo_io[ch].out_active = 0u;
            g_algo_io[ch].out_led = 0u;
            algo_prev_active[ch] = 0u;
            continue;
        }
        base_active = Cy_CapSense_IsWidgetActive((uint32_t)ch, &cy_capsense_context);

        if (use_algo)
        {
            active = algo_engine_run_channel(ch, base_active);
            /* 只认算法自己写的 out_led; 算法不写 → 恒 0 → 不点灯。 */
            if (g_algo_io[ch].out_led != 0u) { algo_led = true; }
        }
        else
        {
            active = base_active;
            /* 未加载 JIT 时 trace 仍需反映实测触控态，不能留下上次算法的陈旧结果。 */
            g_algo_io[ch].out_active = (uint16_t)base_active;
            /* 无算法即无点灯请求: 原生 CapSense 触控不得点灯(否则又变成固件写死的触控反馈)。 */
            g_algo_io[ch].out_led = 0u;
        }

        if (active != 0u)
        {
            mask[ch >> 3u] |= (uint8_t)(1u << (ch & 7u));
        }
    }

    /* ★白 LED 只由算法显式请求(out_led)驱动★: 此前这里写的是 `use_algo && algo_active`,
     * 即把触控判定结果当成点灯信号写死 —— 任何算法(含默认 v3.1 HDR)只要判定触摸就必然亮灯,
     * 用户换算法也改不掉。现在改为汇总算法写出的 out_led: 不写该字段的算法一律不点灯。
     * 触控帧输出不受影响, 协议语义不变。 */
    g_any_active = use_algo && algo_led;

    st = Cy_SysLib_EnterCriticalSection();
    touch_frame[0] = SENSOR_FRAME_MAGIC;
    touch_frame[1] = SENSOR_CMD_TOUCH;
    touch_frame[2] = mask[0];
    touch_frame[3] = mask[1];
    touch_frame[4] = mask[2];
    touch_frame[5] = mask[3];
    touch_frame[6] = mask[4];
    Cy_SysLib_ExitCriticalSection(st);
}

/* 把当前触控帧装入 TX FIFO（作为默认/流水线响应）。 */
static void spi_load_touch(void)
{
    uint32_t st = Cy_SysLib_EnterCriticalSection();
    spi_dma.tx_frame[0] = touch_frame[0]; spi_dma.tx_frame[1] = touch_frame[1];
    spi_dma.tx_frame[2] = touch_frame[2]; spi_dma.tx_frame[3] = touch_frame[3];
    spi_dma.tx_frame[4] = touch_frame[4]; spi_dma.tx_frame[5] = touch_frame[5];
    spi_dma.tx_frame[6] = touch_frame[6];
    Cy_SysLib_ExitCriticalSection(st);
    spi_dma_arm_tx();
}

