NKQC/maimai-input-control-firmware/psoc_firmware/CY8C4147AZI-SensorCore/main.c
// ---- Phase A：运行时 CSD 参数读写（直写 cy_capsense_tuner.widgetContext RAM）----
// 阈值类(fingerTh/noiseTh/hysteresis/onDebounce/lowBslnRst)在下次 ProcessAllWidgets 自动生效；
// 硬件类(resolution/snsClk/idacMod)需 APPLY(重扫/重校准)。单字段 16/8 位写在 CM0+ 上原子。
/* CSD 参数合法性防护: 非法值会让转换railed(满量程)/时钟异常/校准发散, 故在应用点拒绝越界值,
 * 保留原值不变。范围依据 CSDv2(cy_capsense_structure.h):
 *   RESOLUTION 6..16 位; SNS_CLK_DIV 1..255(0会除零); IDAC_MOD 0..127(7位);
 *   IDAC_GAIN 增益档 0..6(表7项, 索引7越界崩溃); SNS_CLK_SOURCE 低7位(去 AUTO 0x80)取值 0..6。
 * ★三处同源★ 与 main_firmware/src/service/sensor_link/sensor_link.cpp::_handle_param_set 及
 * control_software/src/proto/telemetry.rs::param_fence 必须逐位等价, 任何一处改动三处同改。 */
static bool _param_value_legal(uint8_t param_id, uint32_t value)
{
    switch (param_id)
    {
        case PARAM_RESOLUTION:     return (value >= 6u)  && (value <= 16u);
        case PARAM_SNS_CLK_DIV:    return (value >= 1u)  && (value <= 255u);
        case PARAM_IDAC_MOD:       return (value <= 127u);
        case PARAM_IDAC_GAIN:      return (value <= 6u);   /* 增益档 0..6(表7项,索引7越界崩溃) */
        case PARAM_SNS_CLK_SOURCE: return ((value & 0x7Fu) <= 6u);
        case PARAM_ENABLED:        return (value <= 1u);   /* 硬件开关: 只有 0/1 有意义 */
        /* 阈值/迟滞/消抖类为 16/8 位任意值, 无硬件危险, 不额外限制。 */
        default: return true;
    }
}

/* 返回是否被接受(合法); 非法直接拒绝, 供 SPI 层回显真实(未改)值让上位机据实回读。 */
static bool cmd_set_param(uint8_t ch, uint8_t param_id, uint32_t value)
{
    if (ch >= SENSOR_CHANNEL_COUNT) return false;
    if (!_param_value_legal(param_id, value)) return false;   // 防护: 拒绝非法值
    cy_stc_capsense_widget_context_t * wc = &cy_capsense_tuner.widgetContext[ch];
    switch (param_id)
    {
        case PARAM_FINGER_TH:    wc->fingerTh   = (uint16_t)value; break;
        case PARAM_NOISE_TH:     wc->noiseTh    = (uint16_t)value; break;
        case PARAM_NEG_NOISE_TH: wc->nNoiseTh   = (uint16_t)value; break;
        case PARAM_HYSTERESIS:   wc->hysteresis = (uint16_t)value; break;
        case PARAM_ON_DEBOUNCE:  wc->onDebounce = (uint8_t)value;  break;
        case PARAM_LOW_BSLN_RST: wc->lowBslnRst = (uint16_t)value; break;
        case PARAM_RESOLUTION:    wc->resolution   = (uint16_t)value; break;
        case PARAM_SNS_CLK_DIV:
            wc->snsClk = (uint16_t)value;
            /* 记录"谁把分频改了": 只有经 SET_PARAM 这条路才会累加。若 clk_now 变成 8 而本计数为 0,
             * 说明是中间件内部路径(Init/Initialize/Enable)改的, 不是上位机/store 推的。 */
            spi_dbg.clk_set_cnt++;
            spi_dbg.clk_set_last = (value & 0xFFFFu) | ((uint32_t)ch << 16u);
            break;
        case PARAM_IDAC_MOD:      wc->idacMod[0]   = (uint8_t)value;  break;
        case PARAM_SNS_CLK_SOURCE:wc->snsClkSource = (uint8_t)value;  break;
        /* 用户显式设增幅 → 锁定该通道, 后续任何校准/Enable 冲回后都会被恢复成此值。 */
        case PARAM_IDAC_GAIN:     wc->idacGainIndex= (uint8_t)value;
                                  g_idac_lock.gain[ch] = (uint8_t)value;
                                  g_idac_lock.mask |= ((uint64_t)1u << ch);
                                  break;
        /* ★启用开关只在 ISR 里改位图, 真正的生效(改 widget 状态 / 重校准 / 基线)在主循环★
         * Cy_CapSense_SetWidgetStatus 内部会走 SwitchSensingMode(重配 CSD HW), 那是不能在 ISR 里
         * 做的事; 且必须在 NOT_BUSY 窗口做, 否则会打断正在进行的转换。 */
        case PARAM_ENABLED: {
            const uint64_t bit = ((uint64_t)1u << ch);
            const bool want = (value != 0u);
            /* 启动 provision 需看到每个通道的明确值，0 也是有效配置，不能靠位图变化推断。 */
            if (g_provision_pending) { g_provision_enable_seen |= bit; }
            if (want == ((g_ch_enabled & bit) != 0u)) break;   /* 无变化: 不惊动扫描 */
            if (want) { g_ch_enabled |= bit; } else { g_ch_enabled &= ~bit; }
            ch_enable_dirty |= bit;
            break;
        }
        default: return false;
    }
    if ((param_id == PARAM_SNS_CLK_DIV) || (param_id == PARAM_RESOLUTION) ||
        (param_id == PARAM_IDAC_GAIN))
    {
        idac_dirty_mask |= ((uint64_t)1u << ch);
    }
    return true;
}

static uint32_t cmd_get_param(uint8_t ch, uint8_t param_id)
{
    if (ch >= SENSOR_CHANNEL_COUNT) return 0u;
    const cy_stc_capsense_widget_context_t * wc = &cy_capsense_tuner.widgetContext[ch];
    switch (param_id)
    {
        case PARAM_FINGER_TH:    return wc->fingerTh;
        case PARAM_NOISE_TH:     return wc->noiseTh;
        case PARAM_NEG_NOISE_TH: return wc->nNoiseTh;
        case PARAM_HYSTERESIS:   return wc->hysteresis;
        case PARAM_ON_DEBOUNCE:  return wc->onDebounce;
        case PARAM_LOW_BSLN_RST: return wc->lowBslnRst;
        case PARAM_RESOLUTION:    return wc->resolution;
        case PARAM_SNS_CLK_DIV:   return wc->snsClk;
        case PARAM_IDAC_MOD:      return wc->idacMod[0];
        case PARAM_SNS_CLK_SOURCE:return wc->snsClkSource;
        case PARAM_IDAC_GAIN:     return wc->idacGainIndex;
        /* 读位图而不是读 widgetContext.status: 位图是本固件的意图真相源, 而 status 会被
         * Cy_CapSense_Init 重置(重放前的那一瞬会读出不一致值)。 */
        case PARAM_ENABLED:       return _ch_is_enabled(ch) ? 1u : 0u;
        default: return 0u;
    }
}

/* 把 g_ch_enabled 位图重放到中间件的 widget 状态位。
 * ★何时必须调★ 只有 Cy_CapSense_Init 会把全部 widget 的 ENABLE|WORKING 重新置起
 * (cy_capsense_control.c:147), 所以启动 Init 之后与 GLOBAL_COMMIT 的 Init 之后各调一次即可 ——
 * 与 _widget_hw_restore / _idac_lock_restore 完全同一模式(都是"抵消 Init 的 ROM 重铺")。
 * 这里直写 status 位而不调 Cy_CapSense_SetWidgetStatus: 后者附带 SwitchSensingMode(UNDEFINED),
 * 在"Init 之后紧接 Initialize"的序列里会白白多一次 CSD 模式来回。 */
static inline void _ch_enable_restore(void)
{
    uint32_t w;
    for (w = 0u; w < SENSOR_CHANNEL_COUNT; w++)
    {
        cy_stc_capsense_widget_context_t * wc = &cy_capsense_tuner.widgetContext[w];
        if (_ch_is_enabled(w))
        {
            wc->status |= (uint8_t)(CY_CAPSENSE_WD_ENABLE_MASK | CY_CAPSENSE_WD_WORKING_MASK);
        }
        else
        {
            wc->status &= (uint8_t)~(uint8_t)(CY_CAPSENSE_WD_ENABLE_MASK | CY_CAPSENSE_WD_ACTIVE_MASK);
        }
    }
}

/* INACTIVE_SNS is a host-selected operating policy, not the electrical state of disabled
 * channels. SetPinState() follows each CSD widget's actual sensor/electrode layout and
 * applies High-Z to every pin of a ganged electrode. Call only while the middleware is idle. */
static inline void _disabled_widgets_force_highz(void)
{
    uint32_t widget;
    for (widget = 0u; widget < cy_capsense_context.ptrCommonConfig->numWd; widget++)
    {
        const cy_stc_capsense_widget_config_t * cfg = &cy_capsense_context.ptrWdConfig[widget];
        uint32_t sensor;
        if (_ch_is_enabled(widget) || (cfg->senseMethod != CY_CAPSENSE_CSD_GROUP)) { continue; }
        for (sensor = 0u; sensor < cfg->numSns; sensor++)
        {
            (void)Cy_CapSense_SetPinState(widget, sensor, CY_CAPSENSE_HIGHZ, &cy_capsense_context);
        }
    }
}

/* CSDInitialize applies the configurable inactive state to every electrode. Preparing CSD
 * before a calibration or ScanAllWidgets keeps disabled electrodes High-Z without ISR work. */
static inline void _prepare_csd_mode(void)
{
    if (cy_capsense_context.ptrActiveScanSns->currentSenseMethod != CY_CAPSENSE_CSD_GROUP)
    {
        (void)Cy_CapSense_SwitchSensingMode(CY_CAPSENSE_CSD_GROUP, &cy_capsense_context);
    }
    _disabled_widgets_force_highz();
}

/* 只初始化【启用】通道的基线。替代 Cy_CapSense_InitializeAllBaselines ——
 * 后者(cy_capsense_filter.c:407)不查 enable, 会把禁用通道的基线设成它那份陈旧 raw,
 * 白做 36 次无意义写入, 也让"禁用通道不参与任何处理"这条约束出现例外。 */
static inline void _initialize_enabled_baselines(void)
{
    uint32_t w;
    for (w = 0u; w < SENSOR_CHANNEL_COUNT; w++)
    {
        if (_ch_is_enabled(w))
        {
            Cy_CapSense_InitializeWidgetBaseline(w, &cy_capsense_context);
        }
    }
}

/* 主循环(NOT_BUSY 窗口)落实 SPI 收到的启用/禁用请求。
 * 禁用: widget-enable 将其排除出扫描；SetWidgetStatus 会退出 CSD 并按全局 inactive 配置重置
 *       所有电极，故每次状态变更后立即切回 CSD 并显式恢复禁用电极 High-Z。
 * 启用: 恢复 enable 位后只给该 widget 重建 IDAC 与基线，绝不扰动其它通道。 */
static inline void _ch_enable_apply(void)
{
    uint64_t pending;
    uint32_t w;
    if (g_provision_pending) { return; }
    uint32_t st = Cy_SysLib_EnterCriticalSection();
    pending = ch_enable_dirty;
    ch_enable_dirty = 0u;
    Cy_SysLib_ExitCriticalSection(st);
    if (pending == 0u) { return; }

    for (w = 0u; w < SENSOR_CHANNEL_COUNT; w++)
    {
        if ((pending & ((uint64_t)1u << w)) == 0u) { continue; }
        const bool enable = _ch_is_enabled(w);
        (void)Cy_CapSense_SetWidgetStatus(w, CY_CAPSENSE_WD_ENABLE_MASK,
                                          enable ? CY_CAPSENSE_WD_ENABLE_MASK : 0u,
                                          &cy_capsense_context);
        _prepare_csd_mode();
        if (enable)
        {
#if (defined(CY_CAPSENSE_CSD_CALIBRATION_EN) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN))
            if (g_auto_calibrate) { (void)_calibrate_widget_locked(w); }
#endif
            (void)_idac_lock_restore((uint8_t)w);
            Cy_CapSense_InitializeWidgetBaseline(w, &cy_capsense_context);
        }
        else
        {
            /* 触控/算法残留清零: 关闭的通道必须立刻表现为"没被按下", 而不是冻在最后一帧。 */
            cy_capsense_tuner.widgetContext[w].status &= (uint8_t)~(uint8_t)CY_CAPSENSE_WD_ACTIVE_MASK;
            memset(&g_algo_io[w], 0, sizeof(g_algo_io[w]));
            algo_prev_active[w] = 0u;
            /* 关闭期间它不再被校准/自适应触碰, 脏位留着只会在下次 APPLY 时白跑一次校准。 */
            idac_dirty_mask &= ~((uint64_t)1u << w);
        }
    }
}

static inline void _recalibrate_dirty_channels(void)
{
#if (defined(CY_CAPSENSE_CSD_CALIBRATION_EN) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN))
    uint32_t w;

    for (w = 0u; w < SENSOR_CHANNEL_COUNT; w++)
    {
        /* 禁用通道不参与校准: 校准会连接电极(CSDCalibrateWidget → 扫描该 widget), 与"电极保持
         * 高阻"直接冲突; 且它的 IDAC 结果毫无用处。 */
        if (!_ch_is_enabled(w)) { continue; }
        if ((idac_dirty_mask & ((uint64_t)1u << w)) != 0u)
        {
            (void)_calibrate_widget_locked(w);   /* 锁定通道按其自身增益档校准 */
        }
    }
    /* 校准把增益档拉回全局起点档, 此处把用户锁定值写回; 调用方随后的 Initialize 使其下到硬件。 */
    (void)_idac_lock_restore(SENSOR_CH_ALL);
#endif
    idac_dirty_mask = 0u;
}

/* Enable() would initialize and immediately start its first scan before callers can repair
 * disabled pins. This replacement keeps the same all-enabled-widget calibration scope, but
 * prepares CSD and forces disabled electrodes High-Z before any calibration sample starts. */
static inline void _calibrate_enabled_channels(void)
{
#if (defined(CY_CAPSENSE_CSD_CALIBRATION_EN) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN))
    uint32_t w;
    for (w = 0u; w < SENSOR_CHANNEL_COUNT; w++)
    {
        if (_ch_is_enabled(w)) { (void)_calibrate_widget_locked(w); }
    }
#endif
    idac_dirty_mask = 0u;
    _idac_lock_reapply();
}

// 装载指令响应帧（直接填 TX FIFO；ISR 上下文，与 spi_load_touch 同）。
static void spi_load_cmd_response(uint8_t command, uint8_t b2, uint8_t b3, uint32_t val24)
{
    spi_dma.tx_frame[0] = SENSOR_FRAME_MAGIC;
    spi_dma.tx_frame[1] = command;
    spi_dma.tx_frame[2] = b2;
    spi_dma.tx_frame[3] = b3;
    spi_dma.tx_frame[4] = (uint8_t)(val24 & 0xFFu);
    spi_dma.tx_frame[5] = (uint8_t)((val24 >> 8u) & 0xFFu);
    spi_dma.tx_frame[6] = (uint8_t)((val24 >> 16u) & 0xFFu);
    spi_dma_arm_tx();
}

static uint16_t cmd_get_raw(uint8_t ch)
{
    if (ch >= SENSOR_CHANNEL_COUNT) return 0u;
    /* 与快照同口径: 禁用通道回 0(无数据), 不回关闭前的陈旧 raw。 */
    if (!_ch_is_enabled(ch)) return 0u;
    return cy_capsense_context.ptrWdConfig[ch].ptrSnsContext[0].raw;
}

