NKQC/maimai-input-control-firmware/psoc_firmware/CY8C4147AZI-SensorCore/main.c
/* 装载本次响应帧到 TX DMA 并重挂通道（照搬官方 CE 的 TX 重挂序: 设源 → 设长 → 指定当前描述符
 * → 置有效 → 使能通道）。TX 描述符配 cpltState=true(完成即自失效), 故每帧必须显式重挂一次;
 * 这同时消除了"描述符完成后仍有效 → TX FIFO 被主机抽空使电平请求重新有效 → 同一帧被反复重发"
 * 的错位隐患。 */
static void spi_dma_arm_tx(void)
{
    /* 先清掉上一次响应在 FIFO 里的残留(流水线换帧), 再重挂描述符。 */
    Cy_SCB_SPI_ClearTxFifo(scb_0_HW);
    Cy_DMAC_Descriptor_SetSrcAddress(DMAC, cpuss_0_dmac_0_chan_1_CHANNEL,
                                     CY_DMAC_DESCRIPTOR_PING, spi_dma.tx_frame);
    Cy_DMAC_Descriptor_SetDataCount(DMAC, cpuss_0_dmac_0_chan_1_CHANNEL,
                                    CY_DMAC_DESCRIPTOR_PING, SENSOR_FRAME_SIZE);
    __DMB();
    Cy_DMAC_Channel_SetCurrentDescriptor(DMAC, cpuss_0_dmac_0_chan_1_CHANNEL,
                                         CY_DMAC_DESCRIPTOR_PING);
    Cy_DMAC_Descriptor_SetState(DMAC, cpuss_0_dmac_0_chan_1_CHANNEL,
                                CY_DMAC_DESCRIPTOR_PING, true);
    Cy_DMAC_Channel_Enable(DMAC, cpuss_0_dmac_0_chan_1_CHANNEL);
}

static void spi_dma_init(void)
{
    static const cy_stc_sysint_t dma_int_cfg =
    {
        .intrSrc = cpuss_interrupt_dma_IRQn,
        .intrPriority = 2u,
    };
    const cy_stc_dmac_channel_config_t rx_channel_config =
    {
        .priority = 3u, .enable = false, .descriptor = CY_DMAC_DESCRIPTOR_PING,
    };
    const cy_stc_dmac_channel_config_t tx_channel_config =
    {
        .priority = 3u, .enable = false, .descriptor = CY_DMAC_DESCRIPTOR_PING,
    };
    const cy_stc_dmac_descriptor_config_t rx_descriptor_config =
    {
        .srcAddress = &scb_0_HW->RX_FIFO_RD, .dstAddress = spi_dma.rx_frame[0],
        .dataCount = SENSOR_FRAME_SIZE, .dataSize = CY_DMAC_BYTE,
        /* ★外设 FIFO 侧必须按字(32bit)访问★: RX_FIFO_RD 是外设寄存器, 只支持字访问;
         * 用 TRANSFER_SIZE_DATA(=dataSize=BYTE)去读它, DMAC 搬不出数据(实测 SPI 从机完全
         * 不应答: link_valid=false、generation=0)。故源(FIFO)= WORD、目的(内存)= DATA(字节)。
         * 这也是 dataSize=BYTE 与 transferSize 分开两个字段的用途所在。 */
        .srcTransferSize = CY_DMAC_TRANSFER_SIZE_WORD, .srcAddrIncrement = false,
        .dstTransferSize = CY_DMAC_TRANSFER_SIZE_DATA, .dstAddrIncrement = true,
        /* ★16CYC★: SCB 的 tr_rx_req/tr_tx_req 是 FIFO **电平**请求(非脉冲)。
         * cy_scb_spi.h 的 "DMA Trigger" 一节明确要求 DMA 描述符配置为 16 Clk_Slow 周期后重触发,
         * 以正确处理 SCB 电平请求的置起/撤销。触发连线本身由 cycfg_routing.c 的
         * Cy_TrigMux_Connect(TRIG0_IN_SCB0_TR_RX_REQ → TRIG0_OUT_CPUSS_DMAC_TR_IN0) 已生成。
         * ★retrigger/cpltState/flipping 一律照搬官方 CE(mtb-example-psoc4-uart-transmit-receive-dma
         * 的 RxDma_ping/pong_config): 4CYC 重触发、完成【不】失效、flipping=true 交替 PING/PONG。
         * cpltState=false + 双描述符 = 任何时刻都有有效描述符接住电平请求, 软件永不需要在 ISR 里
         * 重置正在服务的描述符(那正是此前 RX 只搬一帧就死的原因)。 */
        .retrigger = CY_DMAC_RETRIG_4CYC, .cpltState = false, .interrupt = true,
        .preemptable = true, .flipping = true, .triggerType = CY_DMAC_SINGLE_ELEMENT,
    };
    const cy_stc_dmac_descriptor_config_t tx_descriptor_config =
    {
        .srcAddress = spi_dma.tx_frame, .dstAddress = &scb_0_HW->TX_FIFO_WR,
        .dataCount = SENSOR_FRAME_SIZE, .dataSize = CY_DMAC_BYTE,
        /* 同 RX 反向: 源(内存)按字节, 目的(TX_FIFO_WR 外设寄存器)必须按字访问。 */
        .srcTransferSize = CY_DMAC_TRANSFER_SIZE_DATA, .srcAddrIncrement = true,
        .dstTransferSize = CY_DMAC_TRANSFER_SIZE_WORD, .dstAddrIncrement = false,
        /* ★照搬官方 CE 的 TxDma_ping_config★: 4CYC 重触发 + cpltState=true(完成即自失效) +
         * flipping=false。自失效是关键: 7 字节装完后描述符立即无效, 主机把 FIFO 抽空使 TX 电平
         * 请求重新有效时不会再次搬运同一帧(否则响应会被重复写入而错位)。每帧由 spi_dma_arm_tx
         * 显式重挂。 */
        .retrigger = CY_DMAC_RETRIG_4CYC, .cpltState = true, .interrupt = false,
        .preemptable = true, .flipping = false, .triggerType = CY_DMAC_SINGLE_ELEMENT,
    };

    /* RX 用 PING/PONG 两个描述符交替落帧: 结构相同, 只有目的缓冲不同。 */
    (void)Cy_DMAC_Descriptor_Init(DMAC, cpuss_0_dmac_0_chan_0_CHANNEL,
                                  CY_DMAC_DESCRIPTOR_PING, &rx_descriptor_config);
    (void)Cy_DMAC_Descriptor_Init(DMAC, cpuss_0_dmac_0_chan_0_CHANNEL,
                                  CY_DMAC_DESCRIPTOR_PONG, &rx_descriptor_config);
    Cy_DMAC_Descriptor_SetDstAddress(DMAC, cpuss_0_dmac_0_chan_0_CHANNEL,
                                     CY_DMAC_DESCRIPTOR_PONG, spi_dma.rx_frame[1]);
    (void)Cy_DMAC_Descriptor_Init(DMAC, cpuss_0_dmac_0_chan_1_CHANNEL,
                                  CY_DMAC_DESCRIPTOR_PING, &tx_descriptor_config);
    (void)Cy_DMAC_Channel_Init(DMAC, cpuss_0_dmac_0_chan_0_CHANNEL, &rx_channel_config);
    (void)Cy_DMAC_Channel_Init(DMAC, cpuss_0_dmac_0_chan_1_CHANNEL, &tx_channel_config);
    /* 两个 RX 描述符同时置有效(官方范式), 并把 PING 设为当前描述符。 */
    Cy_DMAC_Descriptor_SetState(DMAC, cpuss_0_dmac_0_chan_0_CHANNEL,
                                CY_DMAC_DESCRIPTOR_PING, true);
    Cy_DMAC_Descriptor_SetState(DMAC, cpuss_0_dmac_0_chan_0_CHANNEL,
                                CY_DMAC_DESCRIPTOR_PONG, true);
    Cy_DMAC_Channel_SetCurrentDescriptor(DMAC, cpuss_0_dmac_0_chan_0_CHANNEL,
                                         CY_DMAC_DESCRIPTOR_PING);
    Cy_DMAC_Descriptor_SetState(DMAC, cpuss_0_dmac_0_chan_1_CHANNEL,
                                CY_DMAC_DESCRIPTOR_PING, false);
    Cy_DMAC_Channel_SetCurrentDescriptor(DMAC, cpuss_0_dmac_0_chan_1_CHANNEL,
                                         CY_DMAC_DESCRIPTOR_PING);
    Cy_DMAC_ClearInterrupt(DMAC, CY_DMAC_INTR_CHAN_0 | CY_DMAC_INTR_CHAN_1);
    Cy_DMAC_SetInterruptMask(DMAC, CY_DMAC_INTR_CHAN_0);
    Cy_SysInt_Init(&dma_int_cfg, spi_dma_isr);
    NVIC_ClearPendingIRQ(cpuss_interrupt_dma_IRQn);
    NVIC_EnableIRQ(cpuss_interrupt_dma_IRQn);
    Cy_SCB_SetRxFifoLevel(scb_0_HW, 0u);
    Cy_SCB_SetTxFifoLevel(scb_0_HW, SENSOR_FRAME_SIZE);

    /* CS 上升沿(取消选择)中断: 帧边界重同步。优先级必须【低于】DMA 完成中断(2), 否则 CS 沿可能
     * 抢在 RX 完成 ISR 之前把刚收满的帧判成半帧丢掉。 */
    {
        static const cy_stc_sysint_t cs_int_cfg =
        {
            .intrSrc = SPI_CS_IRQ,
            .intrPriority = 3u,
        };
        /* cat2 无逐引脚中断屏蔽 API: 配置边沿(INTR_CFG.EDGE_SEL)即使能该引脚中断。 */
        Cy_GPIO_SetInterruptEdge(SPI_CS_PORT, SPI_CS_NUM, CY_GPIO_INTR_RISING);
        Cy_GPIO_ClearInterrupt(SPI_CS_PORT, SPI_CS_NUM);
        Cy_SysInt_Init(&cs_int_cfg, spi_cs_isr);
        NVIC_ClearPendingIRQ(SPI_CS_IRQ);
        NVIC_EnableIRQ(SPI_CS_IRQ);
    }

    Cy_DMAC_Enable(DMAC);
    Cy_DMAC_Channel_Enable(DMAC, cpuss_0_dmac_0_chan_0_CHANNEL);
    /* TX 通道不在此使能: 描述符尚未装载(SetState false), 由首次 spi_load_touch → spi_dma_arm_tx
     * 装帧后使能(与官方 CE 一致: configure_tx_dma 只配不使能)。 */
}

static void spi_slave_init(void)
{
    Cy_SCB_SPI_Init(scb_0_HW, &scb_0_config, &spi_context);
    Cy_SCB_SPI_Enable(scb_0_HW);
    Cy_SCB_SPI_ClearRxFifo(scb_0_HW);
    Cy_SCB_SPI_ClearTxFifo(scb_0_HW);
    update_touch_frame();
    spi_dma_init();
    spi_load_touch();   /* 默认响应=实时触控帧（DMA 流水线快路） */
}

static void spi_dma_isr(void)
{
    uint32_t interrupt = Cy_DMAC_GetInterruptStatusMasked(DMAC);

    if ((interrupt & CY_DMAC_INTR_CHAN_0) != 0u)
    {
        /* flipping=true: 完成时通道的当前描述符已翻到【下一个】, 故刚落帧的是它的反面
         * (照搬官方 CE 的 Isr_DMA 判定)。两个描述符都保持有效, 此处【绝不】调 SetState —— 那会
         * 清掉正在服务中的描述符的传输索引。 */
        cy_en_dmac_descriptor_t current =
            Cy_DMAC_Channel_GetCurrentDescriptor(DMAC, cpuss_0_dmac_0_chan_0_CHANNEL);
        uint8_t completed = (current == CY_DMAC_DESCRIPTOR_PING) ? 1u : 0u;

        Cy_DMAC_ClearInterrupt(DMAC, CY_DMAC_INTR_CHAN_0);
        spi_dma.frame_received = true;
        /* (rx_frames 计数已退役: 链路已修好, 存活由 scan_count_m/ms_tick_m 监视) */
        spi_slave_task(completed);
    }
}

/* ★CS 抬起帧重同步★: SCB 从机没有"被取消选择"的事件(只有 SLAVE_ERR=错时机取消), 而 RX DMA 是
 * 按字节流连续搬运的 —— 一旦某次事务的字节数不等于 7(PSoC 复位期间主机仍在发、RP2040 侧
 * _recover() 清 FIFO、任何一次时序抖动), 7 字节帧边界就会永久错位, 之后每帧 magic 都不在 rx[0],
 * 表现为 RP2040 恒读回非法帧。故用 CS(P1.3) 上升沿(取消选择)做唯一权威的帧边界: 事务结束时若
 * 描述符里留着半帧(或 RX FIFO 有残字节), 就丢弃这些残余并把描述符索引复位, 使下一次事务必然从
 * 帧首开始。完整帧(索引已归零)不受影响, 零副作用。 */
static void spi_cs_isr(void)
{
    const uint32_t intr = Cy_GPIO_GetInterruptStatus(SPI_CS_PORT, SPI_CS_NUM);

    Cy_GPIO_ClearInterrupt(SPI_CS_PORT, SPI_CS_NUM);
    if (intr == 0u) { return; }

    /* RX FIFO 残字节: 上一事务未凑满一个 DMA 元素窗口的剩余, 必须丢掉。 */
    if (Cy_SCB_GetNumInRxFifo(scb_0_HW) != 0u)
    {
        spi_dbg.rx_leftover++;
        Cy_SCB_SPI_ClearRxFifo(scb_0_HW);
    }

