NKQC/maimai-input-control-firmware/psoc_firmware/CY8C4147AZI-SensorCore/main.c
    /* 描述符里留着半帧 ⇒ 帧边界已错位, 复位两个描述符的传输索引重新对齐帧首。
     * SetState(true) 会同时清 CURR_DATA_NR 与 RESPONSE(见 cy_dmac.h), 正是所需语义。 */
    if ((Cy_DMAC_Descriptor_GetCurrentIndex(DMAC, cpuss_0_dmac_0_chan_0_CHANNEL,
                                            CY_DMAC_DESCRIPTOR_PING) != 0u) ||
        (Cy_DMAC_Descriptor_GetCurrentIndex(DMAC, cpuss_0_dmac_0_chan_0_CHANNEL,
                                            CY_DMAC_DESCRIPTOR_PONG) != 0u))
    {
        spi_dbg.cs_resync++;
        Cy_DMAC_Descriptor_SetState(DMAC, cpuss_0_dmac_0_chan_0_CHANNEL,
                                    CY_DMAC_DESCRIPTOR_PING, true);
        Cy_DMAC_Descriptor_SetState(DMAC, cpuss_0_dmac_0_chan_0_CHANNEL,
                                    CY_DMAC_DESCRIPTOR_PONG, true);
        Cy_DMAC_Channel_SetCurrentDescriptor(DMAC, cpuss_0_dmac_0_chan_0_CHANNEL,
                                             CY_DMAC_DESCRIPTOR_PING);
        Cy_DMAC_Channel_Enable(DMAC, cpuss_0_dmac_0_chan_0_CHANNEL);
    }
}

static void spi_slave_task(uint8_t rx_index)
{
    const volatile uint8_t *rx = spi_dma.rx_frame[rx_index & 1u];

    if (rx[0] != SENSOR_FRAME_MAGIC)
    {
        spi_dbg.rx_bad_magic++;
        spi_load_touch();   /* 默认回落触控帧 */
        return;
    }

    // 白灯仅启动时点亮、之后熄灭(见 main())；此处不再随帧翻转链路态。
    switch (rx[1])
    {
        case SENSOR_CMD_PING:
            spi_load_pong(rx[2]);
            break;

        case SENSOR_CMD_SNAPSHOT_BEGIN:
            spi_latch_snapshot(rx[2]);
            break;

        case SENSOR_CMD_SNAPSHOT_PAGE:
            spi_load_snapshot_page(rx[2], rx[3]);
            break;

        case SENSOR_CMD_INDICATOR_ON:
            Cy_GPIO_Write(STATUS_LED_PORT, STATUS_LED_NUM, STATUS_LED_ON_STATE);
            spi_load_pong(rx[2]);
            break;

        case SENSOR_CMD_SET_PARAM: {
            spi_dbg.setparam_cmd++;
            uint32_t val = (uint32_t)rx[4] | ((uint32_t)rx[5] << 8u) | ((uint32_t)rx[6] << 16u);
            (void)cmd_set_param(rx[2], rx[3], val);
            // 回显【实际当前值】(非法被拒时=旧值), 供上位机据实回读, 天然拦截非法调参。
            spi_load_cmd_response(SENSOR_CMD_SET_PARAM, rx[2], rx[3], cmd_get_param(rx[2], rx[3]));
            break;
        }

        case SENSOR_CMD_GET_PARAM:
            spi_load_cmd_response(SENSOR_CMD_GET_PARAM, rx[2], rx[3], cmd_get_param(rx[2], rx[3]));
            break;

        case SENSOR_CMD_GET_RAW:
            spi_load_cmd_response(SENSOR_CMD_GET_RAW, rx[2], 0u, cmd_get_raw(rx[2]));
            break;

        case SENSOR_CMD_GET_STATS:
            spi_load_stats();
            break;

        case SENSOR_CMD_SET_GLOBAL: {
            uint32_t val = (uint32_t)rx[4] | ((uint32_t)rx[5] << 8u) | ((uint32_t)rx[6] << 16u);
            cmd_set_global(rx[2], val);
            /* ★回显存储值, 不回显请求值★: cmd_set_global 对非法值是"不写、保持原值", 若回显请求值,
             * 上位机拿到的就是自己刚发的数, 无法分辨"写进去了"还是"被拒了"(实测 MFS 被静默截断时
             * 界面显示正常)。回读存储值后, 上位机的回读对账就能自己发现不一致。 */
            spi_load_cmd_response(SENSOR_CMD_SET_GLOBAL, rx[2], 0u, cmd_get_global(rx[2]));
            break;
        }

        case SENSOR_CMD_GET_GLOBAL:
            spi_load_cmd_response(SENSOR_CMD_GET_GLOBAL, rx[2], 0u, cmd_get_global(rx[2]));
            break;

        case SENSOR_CMD_GLOBAL_COMMIT:
            // 全部全局项已设入影子 → 主循环执行【一次】完整重初始化生效。
            global_apply_pending = true;
            g_op_busy = 1u;   // 处理中锁定: 主循环完成完整重初始化后清 0
            spi_load_cmd_response(SENSOR_CMD_GLOBAL_COMMIT, 0u, 0u, 0u);
            break;

        case SENSOR_CMD_MEASURE_CP:
            // 耗时测量由主循环执行；ACK 仅表示命令已由 SPI ISR 实际接收并置为 pending。
            // busy 覆盖 BIST 与其后的正常 CSD 恢复，RP 只会在恢复完成后继续任何重操作。
            measure_cp_pending = true;
            g_op_busy = 1u;
            spi_load_cmd_response(SENSOR_CMD_MEASURE_CP, 0u, 0u, 0u);
            break;

        case SENSOR_CMD_GET_CP:
            // pending/active 时统一返回 0，防止 ISR 观察到主循环逐通道更新的半成品。
            spi_load_cmd_response(SENSOR_CMD_GET_CP, rx[2], 0u,
                                  (rx[2] >= SENSOR_CHANNEL_COUNT) ? 0xFFFFFFu :
                                  ((measure_cp_pending || measure_cp_active) ? 0u : cp_value[rx[2]]));
            break;

        case SENSOR_CMD_APPLY:
            // ★不能在 ISR 里做重校准(耗时数ms/需扫描完成)★：仅置标志，主循环执行。
            // 启动 gate 只承认已经收到全 36 个 enabled 值之后的 APPLY；该 APPLY 完成前不扫描。
            if (g_provision_pending && (g_provision_enable_seen == CH_ENABLED_ALL))
            {
                g_provision_apply_release = true;
            }
            apply_pending = true;
            g_op_busy = 1u;   // 处理中锁定
            spi_load_cmd_response(SENSOR_CMD_APPLY, 0u, 0u, 0u);
            break;

        case SENSOR_CMD_CALIBRATE:
            // 真正的 IDAC 重校准 + 基线复位; 耗时, 仅置标志由主循环执行。
            // rx[2]=目标通道(0..35 单通道 / 0xFF 全通道), 与 AUTO_TUNE 同构; 非法值退化为全通道。
            // ★已 pending 时以最后一条为准★: RP2040 侧 heavy_gate 已拦住堆叠, host 侧又是串行队列,
            //   故不会出现"两条不同通道的请求同时在队"; 真出现也只是最后一条生效, 不会做出错通道。
            calibrate_ch = (rx[2] < SENSOR_CHANNEL_COUNT) ? rx[2] : SENSOR_CH_ALL;
            calibrate_pending = true;
            g_op_busy = 1u;   // 处理中锁定
            spi_load_cmd_response(SENSOR_CMD_CALIBRATE, calibrate_ch, 0u, 0u);
            break;

        case SENSOR_CMD_BASELINE_RESET:
            // 基线复位; rx[2]=目标通道(0..35 单通道 / 0xFF 全通道)。单通道时主循环只初始化该 widget。
            baseline_ch = (rx[2] < SENSOR_CHANNEL_COUNT) ? rx[2] : SENSOR_CH_ALL;
            baseline_reset_pending = true;
            g_op_busy = 1u;   // 处理中锁定
            spi_load_cmd_response(SENSOR_CMD_BASELINE_RESET, baseline_ch, 0u, 0u);
            break;

        case SENSOR_CMD_AUTO_TUNE:
            // 频率自适应下探(耗时: 粗定位+细搜+落档重校准); 仅置标志由主循环执行, 结果经 GET_AUTO_TUNE 读。
            // rx[2]=目标通道(0..35 单通道 / 0xFF 全通道); 非法值退化为全通道。
            // rx[3]=灵敏度偏好档位(1..7); 非法/缺省(0)退化为 4(居中)。
            // rx[4]=本轮请求标签(6 bit, 0=未标记): 原样存下并由 GET_AUTO_TUNE 回显, 供 RP2040 认出
            //       "读到的是上一轮的残留结果"(见 auto_tune_tag 注释)。
            auto_tune_ch      = (rx[2] < SENSOR_CHANNEL_COUNT) ? rx[2] : AUTO_TUNE_CH_ALL;
            auto_tune_pref    = ((rx[3] >= 1u) && (rx[3] <= 7u)) ? rx[3] : 4u;
            auto_tune_tag     = (uint8_t)(rx[4] & AUTO_TUNE_TAG_MASK);
            auto_tune_pending = true;
            auto_tune_result  = 0u;   // 进行中
            auto_tune_phase   = AUTO_TUNE_PHASE_IDLE;   // 已受理, 主循环下一轮开始推进阶段
            auto_tune_step    = 0u;
            auto_tune_div     = 0u;
            g_op_busy = 1u;           // 处理中锁定(host 轮询 busy 至真实完成)
            // 受理回显里也带上标签(byte3): RP2040 的 _send_heavy 收割到本帧即可确认"这一条被收下了"。
            spi_load_cmd_response(SENSOR_CMD_AUTO_TUNE, auto_tune_ch, auto_tune_tag, 0u);
            break;

        case SENSOR_CMD_GET_AUTO_TUNE:
            // 读结果/进度: [result|tag<<2, ch, div_lo, div_hi, progress]; progress = phase | (step << 3)。
            // result 只取 0/1/2 ⇒ 高 6 位承载本轮请求标签(旧 RP 固件不带标签时回显 0, 行为不变)。
            spi_load_cmd_response(SENSOR_CMD_GET_AUTO_TUNE,
                                  (uint8_t)((auto_tune_result & AUTO_TUNE_RESULT_MASK) |
                                            ((auto_tune_tag & AUTO_TUNE_TAG_MASK) << 2u)),
                                  auto_tune_ch,
                                  (uint32_t)auto_tune_div |
                                  (((uint32_t)(auto_tune_phase & 0x07u) |
                                    ((uint32_t)(auto_tune_step & 0x1Fu) << 3u)) << 16u));
            break;

        case SENSOR_CMD_SET_MODE:
            // rx[2]: 0=自动校准/标准完整处理，非0=半自动手动。主循环据此选处理链。
            scan_mode = (rx[2] != 0u) ? SCAN_MODE_SEMI : SCAN_MODE_AUTO;
            spi_load_cmd_response(SENSOR_CMD_SET_MODE, scan_mode, 0u, 0u);
            break;

