NKQC/maimai-input-control-firmware/psoc_firmware/CY8C4147AZI-SensorCore/main.c
                algo_commit_pending = false;
                len = algo_expected_len;
                crc_expect = algo_commit_crc;
                crc_calc = algo_crc16(algo_staging, len);

                if (crc_calc == crc_expect)
                {
                    memcpy(algo_slot, algo_staging, ALGO_SLOT_SIZE);
                    algo_len = len;
                    algo_valid = true;
                }
                /* CRC 不一致：拒绝，algo_valid 保持旧值不变。 */
            }

            /* 全局 CSD 配置改动：完整 Init + Initialize 重初始化，重算 inactive_sns/IDAC/MFS
             * 的内部预计算；随后显式恢复禁用电极 High-Z。轻量 APPLY 不重算 → 会坏扫描。 */
            if (global_apply_pending)
            {
                spi_dbg.stage = MLOOP_STAGE_GLOBAL_APPLY;
                global_apply_pending = false;
                /* 全局配置变更应用: Init 从 ptrCommonConfig(RAM 影子)重算内部预计算
                 * (含 csdInactiveSnsDm/HSIOM)，随后 Initialize 写回硬件状态。
                 * ★不再调 Cy_CapSense_DeInit★: 实测运行时 DeInit→Init→Enable 会把扫描速率从 ~180Hz
                 * 掉到 ~15Hz(疑似 DeInit 未复位时钟分频, 再 Init 残留慢时钟); 仅 Init→Initialize
                 * 同样重算全局预计算且保持满速。 */
                /* Init 会从 ROM 生成配置重铺 widgetContext, 打掉当前生效的 resolution/snsClk
                 * (启动归一的 32, 或用户 SET_PARAM / AUTO_TUNE 的逐通道值) → 见 _widget_hw_save 注释。 */
                _widget_hw_save();
                (void)Cy_CapSense_Init(&cy_capsense_context);
                _widget_hw_restore();
                /* Cy_CapSense_Init 会把全部 widget 的 ENABLE|WORKING 重新置起
                 * (cy_capsense_control.c:147) —— 不重放位图, 用户关掉的通道会在每次"全局应用"
                 * 后偷偷复活并重新参与扫描(电极离开 High-Z)。 */
                _ch_enable_restore();
                /* Init 会按 ptrCommonConfig 重铺 widgetContext 增益档 → 先把用户锁定值写回,
                 * 再由紧随其后的 Initialize 一并下到硬件(不额外触发校准)。 */
                (void)_idac_lock_restore(SENSOR_CH_ALL);
                /* ★配置更新只重算内部预计算, 不再自动校准/频率下探(转一圈)★:
                 * 恒走轻量 Initialize+基线路径, 沿用现有(上次手动校准的)IDAC。
                 * Enable 的自动校准(SmartSense 可含频率自适应)耗时长会阻塞→掉 USB, 且用户要求
                 * "频率自适应探测只能手动触发"。故校准/频率下探仅由显式 CALIBRATE / AUTO_TUNE 命令触发,
                 * 配置改动(inactive_sns/IDAC/MFS)本身即时生效但不重扫校准。 */
                (void)Cy_CapSense_Initialize(&cy_capsense_context);
                _prepare_csd_mode();
                _initialize_enabled_baselines();
            }

            /* APPLY 指令：在主循环(非 ISR)重新初始化扫描硬件使硬件参数(分辨率/时钟/IDAC)生效。 */
            if (apply_pending)
            {
                const uint32_t apply_t0 = g_ms_tick;
                spi_dbg.stage = MLOOP_STAGE_APPLY;

                apply_pending = false;
                if (scan_mode == SCAN_MODE_AUTO && g_auto_calibrate)
                {
                    /* Do not call Enable here: it performs Initialize then starts ScanAllWidgets internally,
                     * leaving no application point to restore disabled electrodes before the first sample. */
                    spi_dbg.stage = MLOOP_STAGE_APPLY_INIT;
                    (void)Cy_CapSense_Initialize(&cy_capsense_context);
                    _prepare_csd_mode();
                    spi_dbg.stage = MLOOP_STAGE_APPLY_RECAL;
                    _calibrate_enabled_channels();
                    spi_dbg.stage = MLOOP_STAGE_APPLY_BASELINE;
                    _initialize_enabled_baselines();
                }
                else
                {
                    /* Fixed-IDAC apply still resets every IO through Initialize; restore the disabled
                     * electrical contract before resuming scan scheduling. */
                    if (g_auto_calibrate)
                    {
                        spi_dbg.stage = MLOOP_STAGE_APPLY_RECAL;
                        _recalibrate_dirty_channels();
                    }
                    spi_dbg.stage = MLOOP_STAGE_APPLY_INIT;
                    (void)Cy_CapSense_Initialize(&cy_capsense_context);
                    _prepare_csd_mode();
                    spi_dbg.stage = MLOOP_STAGE_APPLY_BASELINE;
                    _initialize_enabled_baselines();
                }
                (void)apply_t0;
                /* APPLY 是 RP provisioning 的 FIFO 完成屏障：只有主循环已执行完重配后才开闸。 */
                if (g_provision_apply_release)
                {
                    g_provision_apply_release = false;
                    g_provision_pending = false;
                }
            }

            /* CALIBRATE：真正的 IDAC 重校准(把 raw 拉回目标, 修 railed), 再复位基线。
             * 与 APPLY 区分——APPLY 只重配/re-init, 不重算 IDAC; 半自动手动下"校准"必须走这里
             * 才有效(否则 raw 一直卡满量程 diff=0)。CalibrateAllWidgets 需校准使能。 */
            if (calibrate_pending)
            {
                /* ★单通道语义端到端透传★: cal_target < 36 ⇒ 只校准该 widget 并只初始化该 widget
                 * 的基线(禁止 InitializeAllBaselines 把其它 35 个通道的基线一并冲掉)。
                 * UI 的"全通道校准"改由 host 串行队列逐通道下发, 故 0xFF 分支只保留兼容入口
                 * (恢复默认 / AUTO_CALIBRATE_EN 上升沿等固件内部触发仍需要它)。 */
                const uint8_t cal_target = calibrate_ch;
                const bool cal_one = (cal_target < SENSOR_CHANNEL_COUNT);
                spi_dbg.stage = MLOOP_STAGE_CALIBRATE;
                calibrate_pending = false;
                calibrate_ch = SENSOR_CH_ALL;   /* 消费即复位: 内部触发(无 rx[2])一律全通道语义 */
#if (defined(CY_CAPSENSE_CSD_CALIBRATION_EN) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN))
                /* ★逐通道校准, 不用 CalibrateAllWidgets★
                 * CalibrateAllWidgets 对全部 widget 一律用【全局起点增益档】csdIdacGainInitIndex,
                 * 而本面板 36 段的 Cp 跨度极大(实测 ch8≈22pF、ch35≈138pF), 各通道的 IDAC 增益档
                 * 本就不该相同 —— 用户逐通道设过的档位记在 g_idac_lock 里, 被它统一按全局档校准后
                 * 等于全部作废(高 Cp 通道压不下来仍 railed, 低 Cp 通道又过冲)。
                 * 故与 _recalibrate_dirty_channels() 同口径: 逐通道调用 _calibrate_widget_locked(),
                 * 它会在校准该通道时临时把全局起点档替换为该通道自己的锁定档, 校准完还原。
                 * 未锁定的通道行为不变(仍用全局档)。 */
                /* ★禁用通道一律跳过★ 校准要连接电极并扫描该 widget, 与"关闭 ⇒ 电极恒高阻"直接
                 * 冲突; 单通道请求落在禁用通道上就是一次无意义(且违背语义)的操作, 直接不做。 */
                if (cal_one)
                {
                    if (_ch_is_enabled((uint32_t)cal_target))
                    {
                        (void)_calibrate_widget_locked((uint32_t)cal_target);
                    }
                }
                else
                {
                    for (uint32_t cal_ch = 0u; cal_ch < SENSOR_CHANNEL_COUNT; cal_ch++)
                    {
                        if (!_ch_is_enabled(cal_ch)) { continue; }
                        (void)_calibrate_widget_locked(cal_ch);
                    }
                }
#else
                (void)Cy_CapSense_Initialize(&cy_capsense_context);
                _prepare_csd_mode();
#endif
                /* 校准会把增益档拉回起点档；只恢复本次目标范围。CSDv2 在后续扫描时按
                 * widgetContext 装载 IDAC，所以不调用全局 Initialize，也不重置其它 widget 状态。 */
                (void)_idac_lock_restore(cal_target);
                if (cal_one)
                {
                    if (_ch_is_enabled((uint32_t)cal_target))
                    {
                        Cy_CapSense_InitializeWidgetBaseline((uint32_t)cal_target, &cy_capsense_context);
                    }
                }
                else
                {
                    _initialize_enabled_baselines();
                }
            }

