NKQC/maimai-input-control-firmware/psoc_firmware/CY8C4147AZI-SensorCore/main.c
            /* BASELINE_RESET：把基线重置到当前 raw(消除历史漂移), 不动 IDAC/参数。
             * baseline_ch < 36 ⇒ 只初始化该 widget 的基线(单通道"基线"不该动其它通道)。 */
            if (baseline_reset_pending)
            {
                const uint8_t bsln_target = baseline_ch;
                spi_dbg.stage = MLOOP_STAGE_BASELINE_RESET;
                baseline_reset_pending = false;
                baseline_ch = SENSOR_CH_ALL;   /* 消费即复位, 同 calibrate_ch */
                if (bsln_target < SENSOR_CHANNEL_COUNT)
                {
                    /* 禁用通道没有"当前 raw"可言(发布值恒 0), 复位它的基线毫无意义 → 跳过。 */
                    if (_ch_is_enabled((uint32_t)bsln_target))
                    {
                        Cy_CapSense_InitializeWidgetBaseline((uint32_t)bsln_target, &cy_capsense_context);
                    }
                }
                else
                {
                    _initialize_enabled_baselines();
                }
            }

            /* AUTO_TUNE：频率自适应下探。高 Cp 电极在高频(小分频)下传感器来不及建立→IDAC 无论如何
             * 都压不到目标%→CalibrateWidget 返回非 SUCCESS。此处从高频起逐档升分频(降频),
             * 每档重校准, 用中间件校准返回状态判定该频率下 IDAC 能否满足目标; 首个成功的分频即为
             * "满足当前 IDAC 设置的最高频率(最快扫描)", 写回该 widgetContext 并记录; 全部档位都失败
             * = 超该通道硬件能力 → 该通道失败。运行时可调, 结果经 GET_AUTO_TUNE 上报。 */
            /* 通道 Cp 跨度极大(22pF~138pF), 单一统一分频无法兼顾 → 两种模式都按【单通道】判定:
             *   auto_tune_ch = 0..35: 只改该 widget 的 snsClk(其余通道不动), CalibrateWidget 判定;
             *   auto_tune_ch = 0xFF : 逐通道各自校准——外层遍历 36 通道, 每通道独立跑完整三步算法,
             *                         各得其自身分频; 不再要求"全通道共用同一分频且全部通过"。 */
            if (auto_tune_pending)
            {
                spi_dbg.stage = MLOOP_STAGE_AUTO_TUNE;
                const uint8_t target_ch = auto_tune_ch;
                const uint8_t pref = auto_tune_pref;
                uint16_t final_div = 0u;
                bool tuned = false;
                auto_tune_pending = false;

                if (target_ch < SENSOR_CHANNEL_COUNT)
                {
                    /* 禁用通道不做频率自适应: 它要逐档连接电极重校准, 与"恒高阻"冲突。
                     * 如实回失败(result=2)而不是假装成功, 上位机据此提示"该通道已关闭"。 */
                    tuned = _ch_is_enabled((uint32_t)target_ch) &&
                            auto_tune_run_ch(target_ch, pref, &final_div);
                }
                else
                {
                    /* 逐通道各自校准: 单通道失败不拖垮全场, 只影响该通道(其分频保持上一次的值)。
                     * 进度期间 auto_tune_ch 回显"当前正在处理的通道", 供上位机显示 CHn/36。 */
                    uint32_t ok_count = 0u;
                    uint32_t w;
                    for (w = 0u; w < SENSOR_CHANNEL_COUNT; w++)
                    {
                        uint16_t ch_div = 0u;
                        if (!_ch_is_enabled(w)) { continue; }
                        auto_tune_ch = (uint8_t)w;
                        if (auto_tune_run_ch((uint8_t)w, pref, &ch_div)) ok_count++;
                    }
                    auto_tune_ch = AUTO_TUNE_CH_ALL;      /* 终态回显请求语义(全通道) */
                    final_div = (uint16_t)ok_count;       /* 完成态: div 字段 = 成功通道数 */
                    tuned = (ok_count > 0u);
                }

                /* 逐档校准会改回起点档；只恢复本次目标范围。扫描会自然装载该 widget 的
                 * 新 gain，不调用全局 Initialize，避免扰动其它 widget 的状态/基线。 */
                (void)_idac_lock_restore(target_ch);
                /* 最终分频只影响本次目标，单通道仅重置该 widget 基线。 */
                if (target_ch < SENSOR_CHANNEL_COUNT)
                {
                    if (_ch_is_enabled((uint32_t)target_ch))
                    {
                        Cy_CapSense_InitializeWidgetBaseline((uint32_t)target_ch, &cy_capsense_context);
                    }
                }
                else
                {
                    _initialize_enabled_baselines();
                }
                auto_tune_div = tuned ? final_div : 0u;   /* 失败: div 无效(否则残留最后一次试探值) */
                auto_tune_phase = AUTO_TUNE_PHASE_DONE;
                auto_tune_step  = 0u;
                auto_tune_result = tuned ? 1u : 2u;       /* 1=成功(至少一个通道) 2=全部失败 */
            }

            /* ★处理中锁定解除★：本轮已把入队的重操作全部做完(且未被 ISR 追加新的)→ 清 busy。
             * RP2040 轮询 GET_STATS 的 busy 字节由 1→0 即判定该重操作真实完成(替代盲等 sleep)。 */
            if (!apply_pending && !calibrate_pending && !baseline_reset_pending &&
                !global_apply_pending && !auto_tune_pending &&
                !measure_cp_pending && !measure_cp_active)
            {
                g_op_busy = 0u;
            }

            /* ★通道启用/禁用在此落实★ 放在所有重操作之后、启动下一轮扫描之前:
             * 此刻 NOT_BUSY 成立(Cy_CapSense_SetWidgetStatus 内部的 SwitchSensingMode 要求),
             * 且新的启用集会立刻对下面这一次 ScanAllWidgets 生效(禁用的 widget 从此不再被 setup,
             * 电极停在 High-Z; 新启用的 widget 已完成校准+基线)。 */
            _ch_enable_apply();

            scan_count++;
            /* 带外 SWD 可读的存活证据: 扫描计数。 */
            spi_dbg.scan_count_m = scan_count;
            spi_dbg.stage = MLOOP_STAGE_SCAN_START;
            /* ★全部通道都被禁用时不得启动扫描★ Cy_CapSense_ScanAllWidgets_V2 会因找不到任何可用
             * widget 而返回 BAD_PARAM 且不置忙标志; 照旧调用只是每轮白跑一次 36 次 SetupWidget 失败。
             * 主循环继续空转(scan_count 照增), 故 RP2040 的"主循环卡死"兜底不会误判。 */
            if (!g_provision_pending && _any_ch_enabled())
            {
                /* All normal reset paths prepare CSD explicitly. This guard only repairs a
                 * subsequent mode change, avoiding a per-scan disabled-widget traversal. */
                if (cy_capsense_context.ptrActiveScanSns->currentSenseMethod != CY_CAPSENSE_CSD_GROUP)
                {
                    _prepare_csd_mode();
                }
                Cy_CapSense_ScanAllWidgets(&cy_capsense_context);
            }
        }
    }
}

/* [] END OF FILE */
